Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1071 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x83c83): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x77874): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x6c2aa): C:/Users/nvnpr/Documents/FreeRTOS/stm32f4_freertos/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 8 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x437e9): signed char
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x271c5): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 8 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1bc34): unsigned char
 <1><44>: Abbrev Number: 8 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x63f7a): short int
 <1><4b>: Abbrev Number: 4 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x6d38e): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 8 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x80359): short unsigned int
 <1><5e>: Abbrev Number: 8 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xb060): long int
 <1><65>: Abbrev Number: 4 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x552a9): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 8 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x29603): long unsigned int
 <1><78>: Abbrev Number: 8 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x3cf4e): long long int
 <1><7f>: Abbrev Number: 8 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1c532): long long unsigned int
 <1><86>: Abbrev Number: 32 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 8 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xab0d): unsigned int
 <1><94>: Abbrev Number: 4 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x271c7): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 12 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x6197a): uint16_t
    <aa>   DW_AT_decl_file   : 4
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x611cc): uint32_t
    <bb>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 22 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x8d>
    <d5>   DW_AT_upper_bound : 0
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 22 (DW_TAG_array_type)
    <d8>   DW_AT_type        : <0xb6>
    <dc>   DW_AT_sibling     : <0xe7>
 <2><e0>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <e1>   DW_AT_type        : <0x8d>
    <e5>   DW_AT_upper_bound : 1
 <2><e6>: Abbrev Number: 0
 <1><e7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e8>   DW_AT_byte_size   : 24
    <e9>   DW_AT_decl_file   : 5
    <ea>   DW_AT_decl_line   : 214
    <eb>   DW_AT_decl_column : 9
    <eb>   DW_AT_sibling     : <0x13d>
 <2><ef>: Abbrev Number: 13 (DW_TAG_member)
    <f0>   DW_AT_name        : CR
    <f3>   DW_AT_decl_file   : 5
    <f4>   DW_AT_decl_line   : 216
    <f5>   DW_AT_decl_column : 17
    <f6>   DW_AT_type        : <0xc2>
    <fa>   DW_AT_data_member_location: 0
 <2><fb>: Abbrev Number: 1 (DW_TAG_member)
    <fc>   DW_AT_name        : (indirect string, offset: 0x41c45): NDTR
    <100>   DW_AT_decl_file   : 5
    <101>   DW_AT_decl_line   : 217
    <102>   DW_AT_decl_column : 17
    <103>   DW_AT_type        : <0xc2>
    <107>   DW_AT_data_member_location: 4
 <2><108>: Abbrev Number: 13 (DW_TAG_member)
    <109>   DW_AT_name        : PAR
    <10d>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 218
    <10f>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xc2>
    <114>   DW_AT_data_member_location: 8
 <2><115>: Abbrev Number: 1 (DW_TAG_member)
    <116>   DW_AT_name        : (indirect string, offset: 0x37862): M0AR
    <11a>   DW_AT_decl_file   : 5
    <11b>   DW_AT_decl_line   : 219
    <11c>   DW_AT_decl_column : 17
    <11d>   DW_AT_type        : <0xc2>
    <121>   DW_AT_data_member_location: 12
 <2><122>: Abbrev Number: 1 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0xc596): M1AR
    <127>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 220
    <129>   DW_AT_decl_column : 17
    <12a>   DW_AT_type        : <0xc2>
    <12e>   DW_AT_data_member_location: 16
 <2><12f>: Abbrev Number: 13 (DW_TAG_member)
    <130>   DW_AT_name        : FCR
    <134>   DW_AT_decl_file   : 5
    <135>   DW_AT_decl_line   : 221
    <136>   DW_AT_decl_column : 17
    <137>   DW_AT_type        : <0xc2>
    <13b>   DW_AT_data_member_location: 20
 <2><13c>: Abbrev Number: 0
 <1><13d>: Abbrev Number: 4 (DW_TAG_typedef)
    <13e>   DW_AT_name        : (indirect string, offset: 0x79a35): DMA_Stream_TypeDef
    <142>   DW_AT_decl_file   : 5
    <143>   DW_AT_decl_line   : 222
    <144>   DW_AT_decl_column : 3
    <145>   DW_AT_type        : <0xe7>
 <1><149>: Abbrev Number: 14 (DW_TAG_structure_type)
    <14a>   DW_AT_byte_size   : 40
    <14b>   DW_AT_decl_file   : 5
    <14c>   DW_AT_decl_line   : 265
    <14e>   DW_AT_decl_column : 9
    <14e>   DW_AT_sibling     : <0x1cb>
 <2><152>: Abbrev Number: 2 (DW_TAG_member)
    <153>   DW_AT_name        : (indirect string, offset: 0xd7c): MODER
    <157>   DW_AT_decl_file   : 5
    <158>   DW_AT_decl_line   : 267
    <15a>   DW_AT_decl_column : 17
    <15b>   DW_AT_type        : <0xc2>
    <15f>   DW_AT_data_member_location: 0
 <2><160>: Abbrev Number: 2 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x67d67): OTYPER
    <165>   DW_AT_decl_file   : 5
    <166>   DW_AT_decl_line   : 268
    <168>   DW_AT_decl_column : 17
    <169>   DW_AT_type        : <0xc2>
    <16d>   DW_AT_data_member_location: 4
 <2><16e>: Abbrev Number: 2 (DW_TAG_member)
    <16f>   DW_AT_name        : (indirect string, offset: 0x745f3): OSPEEDR
    <173>   DW_AT_decl_file   : 5
    <174>   DW_AT_decl_line   : 269
    <176>   DW_AT_decl_column : 17
    <177>   DW_AT_type        : <0xc2>
    <17b>   DW_AT_data_member_location: 8
 <2><17c>: Abbrev Number: 2 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x5f56b): PUPDR
    <181>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 270
    <184>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xc2>
    <189>   DW_AT_data_member_location: 12
 <2><18a>: Abbrev Number: 5 (DW_TAG_member)
    <18b>   DW_AT_name        : IDR
    <18f>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 271
    <191>   DW_AT_decl_column : 17
    <191>   DW_AT_type        : <0xc2>
    <195>   DW_AT_data_member_location: 16
 <2><196>: Abbrev Number: 5 (DW_TAG_member)
    <197>   DW_AT_name        : ODR
    <19b>   DW_AT_decl_file   : 5
    <19b>   DW_AT_decl_line   : 272
    <19d>   DW_AT_decl_column : 17
    <19d>   DW_AT_type        : <0xc2>
    <1a1>   DW_AT_data_member_location: 20
 <2><1a2>: Abbrev Number: 2 (DW_TAG_member)
    <1a3>   DW_AT_name        : (indirect string, offset: 0x1e869): BSRR
    <1a7>   DW_AT_decl_file   : 5
    <1a8>   DW_AT_decl_line   : 273
    <1aa>   DW_AT_decl_column : 17
    <1ab>   DW_AT_type        : <0xc2>
    <1af>   DW_AT_data_member_location: 24
 <2><1b0>: Abbrev Number: 2 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x72924): LCKR
    <1b5>   DW_AT_decl_file   : 5
    <1b6>   DW_AT_decl_line   : 274
    <1b8>   DW_AT_decl_column : 17
    <1b9>   DW_AT_type        : <0xc2>
    <1bd>   DW_AT_data_member_location: 28
 <2><1be>: Abbrev Number: 5 (DW_TAG_member)
    <1bf>   DW_AT_name        : AFR
    <1c3>   DW_AT_decl_file   : 5
    <1c3>   DW_AT_decl_line   : 275
    <1c5>   DW_AT_decl_column : 17
    <1c5>   DW_AT_type        : <0x1db>
    <1c9>   DW_AT_data_member_location: 32
 <2><1ca>: Abbrev Number: 0
 <1><1cb>: Abbrev Number: 22 (DW_TAG_array_type)
    <1cc>   DW_AT_type        : <0xc2>
    <1d0>   DW_AT_sibling     : <0x1db>
 <2><1d4>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <1d5>   DW_AT_type        : <0x8d>
    <1d9>   DW_AT_upper_bound : 1
 <2><1da>: Abbrev Number: 0
 <1><1db>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <1dc>   DW_AT_type        : <0x1cb>
 <1><1e0>: Abbrev Number: 15 (DW_TAG_typedef)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x82198): GPIO_TypeDef
    <1e5>   DW_AT_decl_file   : 5
    <1e6>   DW_AT_decl_line   : 276
    <1e8>   DW_AT_decl_column : 3
    <1e8>   DW_AT_type        : <0x149>
 <1><1ec>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1ed>   DW_AT_byte_size   : 8
    <1ee>   DW_AT_decl_file   : 5
    <1ef>   DW_AT_decl_line   : 326
    <1f1>   DW_AT_decl_column : 9
    <1f1>   DW_AT_sibling     : <0x20d>
 <2><1f5>: Abbrev Number: 5 (DW_TAG_member)
    <1f6>   DW_AT_name        : CR
    <1f9>   DW_AT_decl_file   : 5
    <1f9>   DW_AT_decl_line   : 328
    <1fb>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xc2>
    <1ff>   DW_AT_data_member_location: 0
 <2><200>: Abbrev Number: 5 (DW_TAG_member)
    <201>   DW_AT_name        : CSR
    <205>   DW_AT_decl_file   : 5
    <205>   DW_AT_decl_line   : 329
    <207>   DW_AT_decl_column : 17
    <207>   DW_AT_type        : <0xc2>
    <20b>   DW_AT_data_member_location: 4
 <2><20c>: Abbrev Number: 0
 <1><20d>: Abbrev Number: 15 (DW_TAG_typedef)
    <20e>   DW_AT_name        : (indirect string, offset: 0x6089e): PWR_TypeDef
    <212>   DW_AT_decl_file   : 5
    <213>   DW_AT_decl_line   : 330
    <215>   DW_AT_decl_column : 3
    <215>   DW_AT_type        : <0x1ec>
 <1><219>: Abbrev Number: 14 (DW_TAG_structure_type)
    <21a>   DW_AT_byte_size   : 144
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 336
    <21e>   DW_AT_decl_column : 9
    <21e>   DW_AT_sibling     : <0x3dc>
 <2><222>: Abbrev Number: 5 (DW_TAG_member)
    <223>   DW_AT_name        : CR
    <226>   DW_AT_decl_file   : 5
    <226>   DW_AT_decl_line   : 338
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xc2>
    <22c>   DW_AT_data_member_location: 0
 <2><22d>: Abbrev Number: 2 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x5dcae): PLLCFGR
    <232>   DW_AT_decl_file   : 5
    <233>   DW_AT_decl_line   : 339
    <235>   DW_AT_decl_column : 17
    <236>   DW_AT_type        : <0xc2>
    <23a>   DW_AT_data_member_location: 4
 <2><23b>: Abbrev Number: 2 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0x3a2bb): CFGR
    <240>   DW_AT_decl_file   : 5
    <241>   DW_AT_decl_line   : 340
    <243>   DW_AT_decl_column : 17
    <244>   DW_AT_type        : <0xc2>
    <248>   DW_AT_data_member_location: 8
 <2><249>: Abbrev Number: 5 (DW_TAG_member)
    <24a>   DW_AT_name        : CIR
    <24e>   DW_AT_decl_file   : 5
    <24e>   DW_AT_decl_line   : 341
    <250>   DW_AT_decl_column : 17
    <250>   DW_AT_type        : <0xc2>
    <254>   DW_AT_data_member_location: 12
 <2><255>: Abbrev Number: 2 (DW_TAG_member)
    <256>   DW_AT_name        : (indirect string, offset: 0x6ac6d): AHB1RSTR
    <25a>   DW_AT_decl_file   : 5
    <25b>   DW_AT_decl_line   : 342
    <25d>   DW_AT_decl_column : 17
    <25e>   DW_AT_type        : <0xc2>
    <262>   DW_AT_data_member_location: 16
 <2><263>: Abbrev Number: 2 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0xf19d): AHB2RSTR
    <268>   DW_AT_decl_file   : 5
    <269>   DW_AT_decl_line   : 343
    <26b>   DW_AT_decl_column : 17
    <26c>   DW_AT_type        : <0xc2>
    <270>   DW_AT_data_member_location: 20
 <2><271>: Abbrev Number: 2 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x3a191): AHB3RSTR
    <276>   DW_AT_decl_file   : 5
    <277>   DW_AT_decl_line   : 344
    <279>   DW_AT_decl_column : 17
    <27a>   DW_AT_type        : <0xc2>
    <27e>   DW_AT_data_member_location: 24
 <2><27f>: Abbrev Number: 2 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x7e418): RESERVED0
    <284>   DW_AT_decl_file   : 5
    <285>   DW_AT_decl_line   : 345
    <287>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xb6>
    <28c>   DW_AT_data_member_location: 28
 <2><28d>: Abbrev Number: 2 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xed61): APB1RSTR
    <292>   DW_AT_decl_file   : 5
    <293>   DW_AT_decl_line   : 346
    <295>   DW_AT_decl_column : 17
    <296>   DW_AT_type        : <0xc2>
    <29a>   DW_AT_data_member_location: 32
 <2><29b>: Abbrev Number: 2 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0x39d98): APB2RSTR
    <2a0>   DW_AT_decl_file   : 5
    <2a1>   DW_AT_decl_line   : 347
    <2a3>   DW_AT_decl_column : 17
    <2a4>   DW_AT_type        : <0xc2>
    <2a8>   DW_AT_data_member_location: 36
 <2><2a9>: Abbrev Number: 2 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x7e422): RESERVED1
    <2ae>   DW_AT_decl_file   : 5
    <2af>   DW_AT_decl_line   : 348
    <2b1>   DW_AT_decl_column : 17
    <2b2>   DW_AT_type        : <0xd7>
    <2b6>   DW_AT_data_member_location: 40
 <2><2b7>: Abbrev Number: 2 (DW_TAG_member)
    <2b8>   DW_AT_name        : (indirect string, offset: 0xaaa2): AHB1ENR
    <2bc>   DW_AT_decl_file   : 5
    <2bd>   DW_AT_decl_line   : 349
    <2bf>   DW_AT_decl_column : 17
    <2c0>   DW_AT_type        : <0xc2>
    <2c4>   DW_AT_data_member_location: 48
 <2><2c5>: Abbrev Number: 2 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x23de7): AHB2ENR
    <2ca>   DW_AT_decl_file   : 5
    <2cb>   DW_AT_decl_line   : 350
    <2cd>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0xc2>
    <2d2>   DW_AT_data_member_location: 52
 <2><2d3>: Abbrev Number: 2 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x3be92): AHB3ENR
    <2d8>   DW_AT_decl_file   : 5
    <2d9>   DW_AT_decl_line   : 351
    <2db>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xc2>
    <2e0>   DW_AT_data_member_location: 56
 <2><2e1>: Abbrev Number: 2 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x7e42c): RESERVED2
    <2e6>   DW_AT_decl_file   : 5
    <2e7>   DW_AT_decl_line   : 352
    <2e9>   DW_AT_decl_column : 17
    <2ea>   DW_AT_type        : <0xb6>
    <2ee>   DW_AT_data_member_location: 60
 <2><2ef>: Abbrev Number: 2 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x64eef): APB1ENR
    <2f4>   DW_AT_decl_file   : 5
    <2f5>   DW_AT_decl_line   : 353
    <2f7>   DW_AT_decl_column : 17
    <2f8>   DW_AT_type        : <0xc2>
    <2fc>   DW_AT_data_member_location: 64
 <2><2fd>: Abbrev Number: 2 (DW_TAG_member)
    <2fe>   DW_AT_name        : (indirect string, offset: 0xf888): APB2ENR
    <302>   DW_AT_decl_file   : 5
    <303>   DW_AT_decl_line   : 354
    <305>   DW_AT_decl_column : 17
    <306>   DW_AT_type        : <0xc2>
    <30a>   DW_AT_data_member_location: 68
 <2><30b>: Abbrev Number: 2 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0x7e436): RESERVED3
    <310>   DW_AT_decl_file   : 5
    <311>   DW_AT_decl_line   : 355
    <313>   DW_AT_decl_column : 17
    <314>   DW_AT_type        : <0xd7>
    <318>   DW_AT_data_member_location: 72
 <2><319>: Abbrev Number: 2 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x42b01): AHB1LPENR
    <31e>   DW_AT_decl_file   : 5
    <31f>   DW_AT_decl_line   : 356
    <321>   DW_AT_decl_column : 17
    <322>   DW_AT_type        : <0xc2>
    <326>   DW_AT_data_member_location: 80
 <2><327>: Abbrev Number: 2 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0x1e5bb): AHB2LPENR
    <32c>   DW_AT_decl_file   : 5
    <32d>   DW_AT_decl_line   : 357
    <32f>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xc2>
    <334>   DW_AT_data_member_location: 84
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x5a872): AHB3LPENR
    <33a>   DW_AT_decl_file   : 5
    <33b>   DW_AT_decl_line   : 358
    <33d>   DW_AT_decl_column : 17
    <33e>   DW_AT_type        : <0xc2>
    <342>   DW_AT_data_member_location: 88
 <2><343>: Abbrev Number: 2 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0x7e440): RESERVED4
    <348>   DW_AT_decl_file   : 5
    <349>   DW_AT_decl_line   : 359
    <34b>   DW_AT_decl_column : 17
    <34c>   DW_AT_type        : <0xb6>
    <350>   DW_AT_data_member_location: 92
 <2><351>: Abbrev Number: 2 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0x59080): APB1LPENR
    <356>   DW_AT_decl_file   : 5
    <357>   DW_AT_decl_line   : 360
    <359>   DW_AT_decl_column : 17
    <35a>   DW_AT_type        : <0xc2>
    <35e>   DW_AT_data_member_location: 96
 <2><35f>: Abbrev Number: 2 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0x9f5a): APB2LPENR
    <364>   DW_AT_decl_file   : 5
    <365>   DW_AT_decl_line   : 361
    <367>   DW_AT_decl_column : 17
    <368>   DW_AT_type        : <0xc2>
    <36c>   DW_AT_data_member_location: 100
 <2><36d>: Abbrev Number: 2 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x7e44a): RESERVED5
    <372>   DW_AT_decl_file   : 5
    <373>   DW_AT_decl_line   : 362
    <375>   DW_AT_decl_column : 17
    <376>   DW_AT_type        : <0xd7>
    <37a>   DW_AT_data_member_location: 104
 <2><37b>: Abbrev Number: 2 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0x12d0a): BDCR
    <380>   DW_AT_decl_file   : 5
    <381>   DW_AT_decl_line   : 363
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0xc2>
    <388>   DW_AT_data_member_location: 112
 <2><389>: Abbrev Number: 5 (DW_TAG_member)
    <38a>   DW_AT_name        : CSR
    <38e>   DW_AT_decl_file   : 5
    <38e>   DW_AT_decl_line   : 364
    <390>   DW_AT_decl_column : 17
    <390>   DW_AT_type        : <0xc2>
    <394>   DW_AT_data_member_location: 116
 <2><395>: Abbrev Number: 2 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x7e454): RESERVED6
    <39a>   DW_AT_decl_file   : 5
    <39b>   DW_AT_decl_line   : 365
    <39d>   DW_AT_decl_column : 17
    <39e>   DW_AT_type        : <0xd7>
    <3a2>   DW_AT_data_member_location: 120
 <2><3a3>: Abbrev Number: 2 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x47627): SSCGR
    <3a8>   DW_AT_decl_file   : 5
    <3a9>   DW_AT_decl_line   : 366
    <3ab>   DW_AT_decl_column : 17
    <3ac>   DW_AT_type        : <0xc2>
    <3b0>   DW_AT_data_member_location: 128
 <2><3b1>: Abbrev Number: 2 (DW_TAG_member)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x2c42c): PLLI2SCFGR
    <3b6>   DW_AT_decl_file   : 5
    <3b7>   DW_AT_decl_line   : 367
    <3b9>   DW_AT_decl_column : 17
    <3ba>   DW_AT_type        : <0xc2>
    <3be>   DW_AT_data_member_location: 132
 <2><3bf>: Abbrev Number: 2 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x7e45e): RESERVED7
    <3c4>   DW_AT_decl_file   : 5
    <3c5>   DW_AT_decl_line   : 368
    <3c7>   DW_AT_decl_column : 17
    <3c8>   DW_AT_type        : <0xc7>
    <3cc>   DW_AT_data_member_location: 136
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x3a2b8): DCKCFGR
    <3d2>   DW_AT_decl_file   : 5
    <3d3>   DW_AT_decl_line   : 369
    <3d5>   DW_AT_decl_column : 17
    <3d6>   DW_AT_type        : <0xc2>
    <3da>   DW_AT_data_member_location: 140
 <2><3db>: Abbrev Number: 0
 <1><3dc>: Abbrev Number: 15 (DW_TAG_typedef)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x3e0a9): RCC_TypeDef
    <3e1>   DW_AT_decl_file   : 5
    <3e2>   DW_AT_decl_line   : 370
    <3e4>   DW_AT_decl_column : 3
    <3e4>   DW_AT_type        : <0x219>
 <1><3e8>: Abbrev Number: 14 (DW_TAG_structure_type)
    <3e9>   DW_AT_byte_size   : 36
    <3ea>   DW_AT_decl_file   : 5
    <3eb>   DW_AT_decl_line   : 452
    <3ed>   DW_AT_decl_column : 9
    <3ed>   DW_AT_sibling     : <0x466>
 <2><3f1>: Abbrev Number: 5 (DW_TAG_member)
    <3f2>   DW_AT_name        : CR1
    <3f6>   DW_AT_decl_file   : 5
    <3f6>   DW_AT_decl_line   : 454
    <3f8>   DW_AT_decl_column : 17
    <3f8>   DW_AT_type        : <0xc2>
    <3fc>   DW_AT_data_member_location: 0
 <2><3fd>: Abbrev Number: 5 (DW_TAG_member)
    <3fe>   DW_AT_name        : CR2
    <402>   DW_AT_decl_file   : 5
    <402>   DW_AT_decl_line   : 455
    <404>   DW_AT_decl_column : 17
    <404>   DW_AT_type        : <0xc2>
    <408>   DW_AT_data_member_location: 4
 <2><409>: Abbrev Number: 5 (DW_TAG_member)
    <40a>   DW_AT_name        : SR
    <40d>   DW_AT_decl_file   : 5
    <40d>   DW_AT_decl_line   : 456
    <40f>   DW_AT_decl_column : 17
    <40f>   DW_AT_type        : <0xc2>
    <413>   DW_AT_data_member_location: 8
 <2><414>: Abbrev Number: 5 (DW_TAG_member)
    <415>   DW_AT_name        : DR
    <418>   DW_AT_decl_file   : 5
    <418>   DW_AT_decl_line   : 457
    <41a>   DW_AT_decl_column : 17
    <41a>   DW_AT_type        : <0xc2>
    <41e>   DW_AT_data_member_location: 12
 <2><41f>: Abbrev Number: 2 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x209e3): CRCPR
    <424>   DW_AT_decl_file   : 5
    <425>   DW_AT_decl_line   : 458
    <427>   DW_AT_decl_column : 17
    <428>   DW_AT_type        : <0xc2>
    <42c>   DW_AT_data_member_location: 16
 <2><42d>: Abbrev Number: 2 (DW_TAG_member)
    <42e>   DW_AT_name        : (indirect string, offset: 0x4fb75): RXCRCR
    <432>   DW_AT_decl_file   : 5
    <433>   DW_AT_decl_line   : 459
    <435>   DW_AT_decl_column : 17
    <436>   DW_AT_type        : <0xc2>
    <43a>   DW_AT_data_member_location: 20
 <2><43b>: Abbrev Number: 2 (DW_TAG_member)
    <43c>   DW_AT_name        : (indirect string, offset: 0x43486): TXCRCR
    <440>   DW_AT_decl_file   : 5
    <441>   DW_AT_decl_line   : 460
    <443>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xc2>
    <448>   DW_AT_data_member_location: 24
 <2><449>: Abbrev Number: 2 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x2c42f): I2SCFGR
    <44e>   DW_AT_decl_file   : 5
    <44f>   DW_AT_decl_line   : 461
    <451>   DW_AT_decl_column : 17
    <452>   DW_AT_type        : <0xc2>
    <456>   DW_AT_data_member_location: 28
 <2><457>: Abbrev Number: 2 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x2f15a): I2SPR
    <45c>   DW_AT_decl_file   : 5
    <45d>   DW_AT_decl_line   : 462
    <45f>   DW_AT_decl_column : 17
    <460>   DW_AT_type        : <0xc2>
    <464>   DW_AT_data_member_location: 32
 <2><465>: Abbrev Number: 0
 <1><466>: Abbrev Number: 15 (DW_TAG_typedef)
    <467>   DW_AT_name        : (indirect string, offset: 0x1f8f2): SPI_TypeDef
    <46b>   DW_AT_decl_file   : 5
    <46c>   DW_AT_decl_line   : 463
    <46e>   DW_AT_decl_column : 3
    <46e>   DW_AT_type        : <0x3e8>
 <1><472>: Abbrev Number: 14 (DW_TAG_structure_type)
    <473>   DW_AT_byte_size   : 28
    <474>   DW_AT_decl_file   : 5
    <475>   DW_AT_decl_line   : 499
    <477>   DW_AT_decl_column : 9
    <477>   DW_AT_sibling     : <0x4d0>
 <2><47b>: Abbrev Number: 5 (DW_TAG_member)
    <47c>   DW_AT_name        : SR
    <47f>   DW_AT_decl_file   : 5
    <47f>   DW_AT_decl_line   : 501
    <481>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0xc2>
    <485>   DW_AT_data_member_location: 0
 <2><486>: Abbrev Number: 5 (DW_TAG_member)
    <487>   DW_AT_name        : DR
    <48a>   DW_AT_decl_file   : 5
    <48a>   DW_AT_decl_line   : 502
    <48c>   DW_AT_decl_column : 17
    <48c>   DW_AT_type        : <0xc2>
    <490>   DW_AT_data_member_location: 4
 <2><491>: Abbrev Number: 5 (DW_TAG_member)
    <492>   DW_AT_name        : BRR
    <496>   DW_AT_decl_file   : 5
    <496>   DW_AT_decl_line   : 503
    <498>   DW_AT_decl_column : 17
    <498>   DW_AT_type        : <0xc2>
    <49c>   DW_AT_data_member_location: 8
 <2><49d>: Abbrev Number: 5 (DW_TAG_member)
    <49e>   DW_AT_name        : CR1
    <4a2>   DW_AT_decl_file   : 5
    <4a2>   DW_AT_decl_line   : 504
    <4a4>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0xc2>
    <4a8>   DW_AT_data_member_location: 12
 <2><4a9>: Abbrev Number: 5 (DW_TAG_member)
    <4aa>   DW_AT_name        : CR2
    <4ae>   DW_AT_decl_file   : 5
    <4ae>   DW_AT_decl_line   : 505
    <4b0>   DW_AT_decl_column : 17
    <4b0>   DW_AT_type        : <0xc2>
    <4b4>   DW_AT_data_member_location: 16
 <2><4b5>: Abbrev Number: 5 (DW_TAG_member)
    <4b6>   DW_AT_name        : CR3
    <4ba>   DW_AT_decl_file   : 5
    <4ba>   DW_AT_decl_line   : 506
    <4bc>   DW_AT_decl_column : 17
    <4bc>   DW_AT_type        : <0xc2>
    <4c0>   DW_AT_data_member_location: 20
 <2><4c1>: Abbrev Number: 2 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x259e5): GTPR
    <4c6>   DW_AT_decl_file   : 5
    <4c7>   DW_AT_decl_line   : 507
    <4c9>   DW_AT_decl_column : 17
    <4ca>   DW_AT_type        : <0xc2>
    <4ce>   DW_AT_data_member_location: 24
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 15 (DW_TAG_typedef)
    <4d1>   DW_AT_name        : (indirect string, offset: 0x84e9c): USART_TypeDef
    <4d5>   DW_AT_decl_file   : 5
    <4d6>   DW_AT_decl_line   : 508
    <4d8>   DW_AT_decl_column : 3
    <4d8>   DW_AT_type        : <0x472>
 <1><4dc>: Abbrev Number: 8 (DW_TAG_base_type)
    <4dd>   DW_AT_byte_size   : 8
    <4de>   DW_AT_encoding    : 4	(float)
    <4df>   DW_AT_name        : (indirect string, offset: 0x86cc9): long double
 <1><4e3>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <4e4>   DW_AT_encoding    : 7	(unsigned)
    <4e5>   DW_AT_byte_size   : 1
    <4e6>   DW_AT_type        : <0x3d>
    <4ea>   DW_AT_decl_file   : 6
    <4eb>   DW_AT_decl_line   : 39
    <4ec>   DW_AT_decl_column : 1
    <4ed>   DW_AT_sibling     : <0x50a>
 <2><4f1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x2d05f): HAL_OK
    <4f6>   DW_AT_const_value : 0
 <2><4f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4f8>   DW_AT_name        : (indirect string, offset: 0x53b6b): HAL_ERROR
    <4fc>   DW_AT_const_value : 1
 <2><4fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x6fbb4): HAL_BUSY
    <502>   DW_AT_const_value : 2
 <2><503>: Abbrev Number: 3 (DW_TAG_enumerator)
    <504>   DW_AT_name        : (indirect string, offset: 0x276d9): HAL_TIMEOUT
    <508>   DW_AT_const_value : 3
 <2><509>: Abbrev Number: 0
 <1><50a>: Abbrev Number: 4 (DW_TAG_typedef)
    <50b>   DW_AT_name        : (indirect string, offset: 0x1664): HAL_StatusTypeDef
    <50f>   DW_AT_decl_file   : 6
    <510>   DW_AT_decl_line   : 44
    <511>   DW_AT_decl_column : 3
    <512>   DW_AT_type        : <0x4e3>
 <1><516>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <517>   DW_AT_encoding    : 7	(unsigned)
    <518>   DW_AT_byte_size   : 1
    <519>   DW_AT_type        : <0x3d>
    <51d>   DW_AT_decl_file   : 6
    <51e>   DW_AT_decl_line   : 50
    <51f>   DW_AT_decl_column : 1
    <520>   DW_AT_sibling     : <0x531>
 <2><524>: Abbrev Number: 3 (DW_TAG_enumerator)
    <525>   DW_AT_name        : (indirect string, offset: 0x6326b): HAL_UNLOCKED
    <529>   DW_AT_const_value : 0
 <2><52a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <52b>   DW_AT_name        : (indirect string, offset: 0x85d86): HAL_LOCKED
    <52f>   DW_AT_const_value : 1
 <2><530>: Abbrev Number: 0
 <1><531>: Abbrev Number: 4 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indirect string, offset: 0x51df0): HAL_LockTypeDef
    <536>   DW_AT_decl_file   : 6
    <537>   DW_AT_decl_line   : 53
    <538>   DW_AT_decl_column : 3
    <539>   DW_AT_type        : <0x516>
 <1><53d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <53e>   DW_AT_byte_size   : 24
    <53f>   DW_AT_decl_file   : 7
    <540>   DW_AT_decl_line   : 45
    <541>   DW_AT_decl_column : 9
    <541>   DW_AT_sibling     : <0x594>
 <2><545>: Abbrev Number: 1 (DW_TAG_member)
    <546>   DW_AT_name        : (indirect string, offset: 0x59ae8): PLLState
    <54a>   DW_AT_decl_file   : 7
    <54b>   DW_AT_decl_line   : 47
    <54c>   DW_AT_decl_column : 12
    <54d>   DW_AT_type        : <0xb6>
    <551>   DW_AT_data_member_location: 0
 <2><552>: Abbrev Number: 1 (DW_TAG_member)
    <553>   DW_AT_name        : (indirect string, offset: 0x5adaa): PLLSource
    <557>   DW_AT_decl_file   : 7
    <558>   DW_AT_decl_line   : 50
    <559>   DW_AT_decl_column : 12
    <55a>   DW_AT_type        : <0xb6>
    <55e>   DW_AT_data_member_location: 4
 <2><55f>: Abbrev Number: 1 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0x6ed78): PLLM
    <564>   DW_AT_decl_file   : 7
    <565>   DW_AT_decl_line   : 53
    <566>   DW_AT_decl_column : 12
    <567>   DW_AT_type        : <0xb6>
    <56b>   DW_AT_data_member_location: 8
 <2><56c>: Abbrev Number: 1 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x6ed7d): PLLN
    <571>   DW_AT_decl_file   : 7
    <572>   DW_AT_decl_line   : 56
    <573>   DW_AT_decl_column : 12
    <574>   DW_AT_type        : <0xb6>
    <578>   DW_AT_data_member_location: 12
 <2><579>: Abbrev Number: 1 (DW_TAG_member)
    <57a>   DW_AT_name        : (indirect string, offset: 0x3e2c8): PLLP
    <57e>   DW_AT_decl_file   : 7
    <57f>   DW_AT_decl_line   : 60
    <580>   DW_AT_decl_column : 12
    <581>   DW_AT_type        : <0xb6>
    <585>   DW_AT_data_member_location: 16
 <2><586>: Abbrev Number: 1 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0x3197c): PLLQ
    <58b>   DW_AT_decl_file   : 7
    <58c>   DW_AT_decl_line   : 63
    <58d>   DW_AT_decl_column : 12
    <58e>   DW_AT_type        : <0xb6>
    <592>   DW_AT_data_member_location: 20
 <2><593>: Abbrev Number: 0
 <1><594>: Abbrev Number: 4 (DW_TAG_typedef)
    <595>   DW_AT_name        : (indirect string, offset: 0x837bd): RCC_PLLInitTypeDef
    <599>   DW_AT_decl_file   : 7
    <59a>   DW_AT_decl_line   : 73
    <59b>   DW_AT_decl_column : 3
    <59c>   DW_AT_type        : <0x53d>
 <1><5a0>: Abbrev Number: 9 (DW_TAG_structure_type)
    <5a1>   DW_AT_byte_size   : 48
    <5a2>   DW_AT_decl_file   : 8
    <5a3>   DW_AT_decl_line   : 49
    <5a4>   DW_AT_decl_column : 9
    <5a4>   DW_AT_sibling     : <0x604>
 <2><5a8>: Abbrev Number: 1 (DW_TAG_member)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x7bbc): OscillatorType
    <5ad>   DW_AT_decl_file   : 8
    <5ae>   DW_AT_decl_line   : 51
    <5af>   DW_AT_decl_column : 12
    <5b0>   DW_AT_type        : <0xb6>
    <5b4>   DW_AT_data_member_location: 0
 <2><5b5>: Abbrev Number: 1 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x5ac57): HSEState
    <5ba>   DW_AT_decl_file   : 8
    <5bb>   DW_AT_decl_line   : 54
    <5bc>   DW_AT_decl_column : 12
    <5bd>   DW_AT_type        : <0xb6>
    <5c1>   DW_AT_data_member_location: 4
 <2><5c2>: Abbrev Number: 1 (DW_TAG_member)
    <5c3>   DW_AT_name        : (indirect string, offset: 0x540f5): LSEState
    <5c7>   DW_AT_decl_file   : 8
    <5c8>   DW_AT_decl_line   : 57
    <5c9>   DW_AT_decl_column : 12
    <5ca>   DW_AT_type        : <0xb6>
    <5ce>   DW_AT_data_member_location: 8
 <2><5cf>: Abbrev Number: 1 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x3b874): HSIState
    <5d4>   DW_AT_decl_file   : 8
    <5d5>   DW_AT_decl_line   : 60
    <5d6>   DW_AT_decl_column : 12
    <5d7>   DW_AT_type        : <0xb6>
    <5db>   DW_AT_data_member_location: 12
 <2><5dc>: Abbrev Number: 1 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x72ed0): HSICalibrationValue
    <5e1>   DW_AT_decl_file   : 8
    <5e2>   DW_AT_decl_line   : 63
    <5e3>   DW_AT_decl_column : 12
    <5e4>   DW_AT_type        : <0xb6>
    <5e8>   DW_AT_data_member_location: 16
 <2><5e9>: Abbrev Number: 1 (DW_TAG_member)
    <5ea>   DW_AT_name        : (indirect string, offset: 0x77b86): LSIState
    <5ee>   DW_AT_decl_file   : 8
    <5ef>   DW_AT_decl_line   : 66
    <5f0>   DW_AT_decl_column : 12
    <5f1>   DW_AT_type        : <0xb6>
    <5f5>   DW_AT_data_member_location: 20
 <2><5f6>: Abbrev Number: 13 (DW_TAG_member)
    <5f7>   DW_AT_name        : PLL
    <5fb>   DW_AT_decl_file   : 8
    <5fc>   DW_AT_decl_line   : 69
    <5fd>   DW_AT_decl_column : 22
    <5fe>   DW_AT_type        : <0x594>
    <602>   DW_AT_data_member_location: 24
 <2><603>: Abbrev Number: 0
 <1><604>: Abbrev Number: 4 (DW_TAG_typedef)
    <605>   DW_AT_name        : (indirect string, offset: 0x47a9b): RCC_OscInitTypeDef
    <609>   DW_AT_decl_file   : 8
    <60a>   DW_AT_decl_line   : 70
    <60b>   DW_AT_decl_column : 3
    <60c>   DW_AT_type        : <0x5a0>
 <1><610>: Abbrev Number: 12 (DW_TAG_const_type)
    <611>   DW_AT_type        : <0x604>
 <1><615>: Abbrev Number: 9 (DW_TAG_structure_type)
    <616>   DW_AT_byte_size   : 20
    <617>   DW_AT_decl_file   : 8
    <618>   DW_AT_decl_line   : 75
    <619>   DW_AT_decl_column : 9
    <619>   DW_AT_sibling     : <0x65f>
 <2><61d>: Abbrev Number: 1 (DW_TAG_member)
    <61e>   DW_AT_name        : (indirect string, offset: 0x2901e): ClockType
    <622>   DW_AT_decl_file   : 8
    <623>   DW_AT_decl_line   : 77
    <624>   DW_AT_decl_column : 12
    <625>   DW_AT_type        : <0xb6>
    <629>   DW_AT_data_member_location: 0
 <2><62a>: Abbrev Number: 1 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x44bbf): SYSCLKSource
    <62f>   DW_AT_decl_file   : 8
    <630>   DW_AT_decl_line   : 80
    <631>   DW_AT_decl_column : 12
    <632>   DW_AT_type        : <0xb6>
    <636>   DW_AT_data_member_location: 4
 <2><637>: Abbrev Number: 1 (DW_TAG_member)
    <638>   DW_AT_name        : (indirect string, offset: 0x6e8d9): AHBCLKDivider
    <63c>   DW_AT_decl_file   : 8
    <63d>   DW_AT_decl_line   : 83
    <63e>   DW_AT_decl_column : 12
    <63f>   DW_AT_type        : <0xb6>
    <643>   DW_AT_data_member_location: 8
 <2><644>: Abbrev Number: 1 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x5018): APB1CLKDivider
    <649>   DW_AT_decl_file   : 8
    <64a>   DW_AT_decl_line   : 86
    <64b>   DW_AT_decl_column : 12
    <64c>   DW_AT_type        : <0xb6>
    <650>   DW_AT_data_member_location: 12
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x3d516): APB2CLKDivider
    <656>   DW_AT_decl_file   : 8
    <657>   DW_AT_decl_line   : 89
    <658>   DW_AT_decl_column : 12
    <659>   DW_AT_type        : <0xb6>
    <65d>   DW_AT_data_member_location: 16
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 4 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0x6784e): RCC_ClkInitTypeDef
    <664>   DW_AT_decl_file   : 8
    <665>   DW_AT_decl_line   : 92
    <666>   DW_AT_decl_column : 3
    <667>   DW_AT_type        : <0x615>
 <1><66b>: Abbrev Number: 12 (DW_TAG_const_type)
    <66c>   DW_AT_type        : <0x65f>
 <1><670>: Abbrev Number: 9 (DW_TAG_structure_type)
    <671>   DW_AT_byte_size   : 20
    <672>   DW_AT_decl_file   : 9
    <673>   DW_AT_decl_line   : 46
    <674>   DW_AT_decl_column : 9
    <674>   DW_AT_sibling     : <0x6ba>
 <2><678>: Abbrev Number: 13 (DW_TAG_member)
    <679>   DW_AT_name        : Pin
    <67d>   DW_AT_decl_file   : 9
    <67e>   DW_AT_decl_line   : 48
    <67f>   DW_AT_decl_column : 12
    <680>   DW_AT_type        : <0xb6>
    <684>   DW_AT_data_member_location: 0
 <2><685>: Abbrev Number: 1 (DW_TAG_member)
    <686>   DW_AT_name        : (indirect string, offset: 0x4de25): Mode
    <68a>   DW_AT_decl_file   : 9
    <68b>   DW_AT_decl_line   : 51
    <68c>   DW_AT_decl_column : 12
    <68d>   DW_AT_type        : <0xb6>
    <691>   DW_AT_data_member_location: 4
 <2><692>: Abbrev Number: 1 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x4567a): Pull
    <697>   DW_AT_decl_file   : 9
    <698>   DW_AT_decl_line   : 54
    <699>   DW_AT_decl_column : 12
    <69a>   DW_AT_type        : <0xb6>
    <69e>   DW_AT_data_member_location: 8
 <2><69f>: Abbrev Number: 1 (DW_TAG_member)
    <6a0>   DW_AT_name        : (indirect string, offset: 0x4ec99): Speed
    <6a4>   DW_AT_decl_file   : 9
    <6a5>   DW_AT_decl_line   : 57
    <6a6>   DW_AT_decl_column : 12
    <6a7>   DW_AT_type        : <0xb6>
    <6ab>   DW_AT_data_member_location: 12
 <2><6ac>: Abbrev Number: 1 (DW_TAG_member)
    <6ad>   DW_AT_name        : (indirect string, offset: 0x3d4d7): Alternate
    <6b1>   DW_AT_decl_file   : 9
    <6b2>   DW_AT_decl_line   : 60
    <6b3>   DW_AT_decl_column : 12
    <6b4>   DW_AT_type        : <0xb6>
    <6b8>   DW_AT_data_member_location: 16
 <2><6b9>: Abbrev Number: 0
 <1><6ba>: Abbrev Number: 4 (DW_TAG_typedef)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x68fde): GPIO_InitTypeDef
    <6bf>   DW_AT_decl_file   : 9
    <6c0>   DW_AT_decl_line   : 62
    <6c1>   DW_AT_decl_column : 2
    <6c2>   DW_AT_type        : <0x670>
 <1><6c6>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <6c7>   DW_AT_encoding    : 7	(unsigned)
    <6c8>   DW_AT_byte_size   : 1
    <6c9>   DW_AT_type        : <0x3d>
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 68
    <6cf>   DW_AT_decl_column : 1
    <6d0>   DW_AT_sibling     : <0x6e1>
 <2><6d4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x1c27e): GPIO_PIN_RESET
    <6d9>   DW_AT_const_value : 0
 <2><6da>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6db>   DW_AT_name        : (indirect string, offset: 0x18384): GPIO_PIN_SET
    <6df>   DW_AT_const_value : 1
 <2><6e0>: Abbrev Number: 0
 <1><6e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <6e2>   DW_AT_name        : (indirect string, offset: 0x83bac): GPIO_PinState
    <6e6>   DW_AT_decl_file   : 9
    <6e7>   DW_AT_decl_line   : 71
    <6e8>   DW_AT_decl_column : 2
    <6e9>   DW_AT_type        : <0x6c6>
 <1><6ed>: Abbrev Number: 9 (DW_TAG_structure_type)
    <6ee>   DW_AT_byte_size   : 48
    <6ef>   DW_AT_decl_file   : 10
    <6f0>   DW_AT_decl_line   : 48
    <6f1>   DW_AT_decl_column : 9
    <6f1>   DW_AT_sibling     : <0x792>
 <2><6f5>: Abbrev Number: 1 (DW_TAG_member)
    <6f6>   DW_AT_name        : (indirect string, offset: 0x63c6e): Channel
    <6fa>   DW_AT_decl_file   : 10
    <6fb>   DW_AT_decl_line   : 50
    <6fc>   DW_AT_decl_column : 12
    <6fd>   DW_AT_type        : <0xb6>
    <701>   DW_AT_data_member_location: 0
 <2><702>: Abbrev Number: 1 (DW_TAG_member)
    <703>   DW_AT_name        : (indirect string, offset: 0x316fa): Direction
    <707>   DW_AT_decl_file   : 10
    <708>   DW_AT_decl_line   : 53
    <709>   DW_AT_decl_column : 12
    <70a>   DW_AT_type        : <0xb6>
    <70e>   DW_AT_data_member_location: 4
 <2><70f>: Abbrev Number: 1 (DW_TAG_member)
    <710>   DW_AT_name        : (indirect string, offset: 0x8c6c): PeriphInc
    <714>   DW_AT_decl_file   : 10
    <715>   DW_AT_decl_line   : 57
    <716>   DW_AT_decl_column : 12
    <717>   DW_AT_type        : <0xb6>
    <71b>   DW_AT_data_member_location: 8
 <2><71c>: Abbrev Number: 1 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x158e2): MemInc
    <721>   DW_AT_decl_file   : 10
    <722>   DW_AT_decl_line   : 60
    <723>   DW_AT_decl_column : 12
    <724>   DW_AT_type        : <0xb6>
    <728>   DW_AT_data_member_location: 12
 <2><729>: Abbrev Number: 1 (DW_TAG_member)
    <72a>   DW_AT_name        : (indirect string, offset: 0x42f1c): PeriphDataAlignment
    <72e>   DW_AT_decl_file   : 10
    <72f>   DW_AT_decl_line   : 63
    <730>   DW_AT_decl_column : 12
    <731>   DW_AT_type        : <0xb6>
    <735>   DW_AT_data_member_location: 16
 <2><736>: Abbrev Number: 1 (DW_TAG_member)
    <737>   DW_AT_name        : (indirect string, offset: 0x791dd): MemDataAlignment
    <73b>   DW_AT_decl_file   : 10
    <73c>   DW_AT_decl_line   : 66
    <73d>   DW_AT_decl_column : 12
    <73e>   DW_AT_type        : <0xb6>
    <742>   DW_AT_data_member_location: 20
 <2><743>: Abbrev Number: 1 (DW_TAG_member)
    <744>   DW_AT_name        : (indirect string, offset: 0x4de25): Mode
    <748>   DW_AT_decl_file   : 10
    <749>   DW_AT_decl_line   : 69
    <74a>   DW_AT_decl_column : 12
    <74b>   DW_AT_type        : <0xb6>
    <74f>   DW_AT_data_member_location: 24
 <2><750>: Abbrev Number: 1 (DW_TAG_member)
    <751>   DW_AT_name        : (indirect string, offset: 0x8a996): Priority
    <755>   DW_AT_decl_file   : 10
    <756>   DW_AT_decl_line   : 74
    <757>   DW_AT_decl_column : 12
    <758>   DW_AT_type        : <0xb6>
    <75c>   DW_AT_data_member_location: 28
 <2><75d>: Abbrev Number: 1 (DW_TAG_member)
    <75e>   DW_AT_name        : (indirect string, offset: 0x399a7): FIFOMode
    <762>   DW_AT_decl_file   : 10
    <763>   DW_AT_decl_line   : 77
    <764>   DW_AT_decl_column : 12
    <765>   DW_AT_type        : <0xb6>
    <769>   DW_AT_data_member_location: 32
 <2><76a>: Abbrev Number: 1 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0x65e4d): FIFOThreshold
    <76f>   DW_AT_decl_file   : 10
    <770>   DW_AT_decl_line   : 82
    <771>   DW_AT_decl_column : 12
    <772>   DW_AT_type        : <0xb6>
    <776>   DW_AT_data_member_location: 36
 <2><777>: Abbrev Number: 1 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x64abe): MemBurst
    <77c>   DW_AT_decl_file   : 10
    <77d>   DW_AT_decl_line   : 85
    <77e>   DW_AT_decl_column : 12
    <77f>   DW_AT_type        : <0xb6>
    <783>   DW_AT_data_member_location: 40
 <2><784>: Abbrev Number: 1 (DW_TAG_member)
    <785>   DW_AT_name        : (indirect string, offset: 0x2d7f1): PeriphBurst
    <789>   DW_AT_decl_file   : 10
    <78a>   DW_AT_decl_line   : 91
    <78b>   DW_AT_decl_column : 12
    <78c>   DW_AT_type        : <0xb6>
    <790>   DW_AT_data_member_location: 44
 <2><791>: Abbrev Number: 0
 <1><792>: Abbrev Number: 4 (DW_TAG_typedef)
    <793>   DW_AT_name        : (indirect string, offset: 0x244f6): DMA_InitTypeDef
    <797>   DW_AT_decl_file   : 10
    <798>   DW_AT_decl_line   : 96
    <799>   DW_AT_decl_column : 2
    <79a>   DW_AT_type        : <0x6ed>
 <1><79e>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <79f>   DW_AT_encoding    : 7	(unsigned)
    <7a0>   DW_AT_byte_size   : 1
    <7a1>   DW_AT_type        : <0x3d>
    <7a5>   DW_AT_decl_file   : 10
    <7a6>   DW_AT_decl_line   : 103
    <7a7>   DW_AT_decl_column : 1
    <7a8>   DW_AT_sibling     : <0x7d1>
 <2><7ac>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x64202): HAL_DMA_STATE_RESET
    <7b1>   DW_AT_const_value : 0
 <2><7b2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x25386): HAL_DMA_STATE_READY
    <7b7>   DW_AT_const_value : 1
 <2><7b8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7b9>   DW_AT_name        : (indirect string, offset: 0x5cb52): HAL_DMA_STATE_BUSY
    <7bd>   DW_AT_const_value : 2
 <2><7be>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7bf>   DW_AT_name        : (indirect string, offset: 0x83e65): HAL_DMA_STATE_TIMEOUT
    <7c3>   DW_AT_const_value : 3
 <2><7c4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7c5>   DW_AT_name        : (indirect string, offset: 0x726bc): HAL_DMA_STATE_ERROR
    <7c9>   DW_AT_const_value : 4
 <2><7ca>: Abbrev Number: 3 (DW_TAG_enumerator)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x1ef04): HAL_DMA_STATE_ABORT
    <7cf>   DW_AT_const_value : 5
 <2><7d0>: Abbrev Number: 0
 <1><7d1>: Abbrev Number: 4 (DW_TAG_typedef)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x4a8ae): HAL_DMA_StateTypeDef
    <7d6>   DW_AT_decl_file   : 10
    <7d7>   DW_AT_decl_line   : 110
    <7d8>   DW_AT_decl_column : 2
    <7d9>   DW_AT_type        : <0x79e>
 <1><7dd>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <7de>   DW_AT_type        : <0x7d1>
 <1><7e2>: Abbrev Number: 24 (DW_TAG_structure_type)
    <7e3>   DW_AT_name        : (indirect string, offset: 0x71b04): __DMA_HandleTypeDef
    <7e7>   DW_AT_byte_size   : 96
    <7e8>   DW_AT_decl_file   : 10
    <7e9>   DW_AT_decl_line   : 138
    <7ea>   DW_AT_decl_column : 16
    <7ea>   DW_AT_sibling     : <0x8a5>
 <2><7ee>: Abbrev Number: 1 (DW_TAG_member)
    <7ef>   DW_AT_name        : (indirect string, offset: 0x33dda): Instance
    <7f3>   DW_AT_decl_file   : 10
    <7f4>   DW_AT_decl_line   : 140
    <7f5>   DW_AT_decl_column : 31
    <7f6>   DW_AT_type        : <0x8a5>
    <7fa>   DW_AT_data_member_location: 0
 <2><7fb>: Abbrev Number: 1 (DW_TAG_member)
    <7fc>   DW_AT_name        : (indirect string, offset: 0x8384d): Init
    <800>   DW_AT_decl_file   : 10
    <801>   DW_AT_decl_line   : 142
    <802>   DW_AT_decl_column : 30
    <803>   DW_AT_type        : <0x792>
    <807>   DW_AT_data_member_location: 4
 <2><808>: Abbrev Number: 1 (DW_TAG_member)
    <809>   DW_AT_name        : (indirect string, offset: 0x5f0a8): Lock
    <80d>   DW_AT_decl_file   : 10
    <80e>   DW_AT_decl_line   : 144
    <80f>   DW_AT_decl_column : 30
    <810>   DW_AT_type        : <0x531>
    <814>   DW_AT_data_member_location: 52
 <2><815>: Abbrev Number: 1 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x5ac5a): State
    <81a>   DW_AT_decl_file   : 10
    <81b>   DW_AT_decl_line   : 146
    <81c>   DW_AT_decl_column : 30
    <81d>   DW_AT_type        : <0x7dd>
    <821>   DW_AT_data_member_location: 53
 <2><822>: Abbrev Number: 1 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0x7f596): Parent
    <827>   DW_AT_decl_file   : 10
    <828>   DW_AT_decl_line   : 148
    <829>   DW_AT_decl_column : 31
    <82a>   DW_AT_type        : <0x8aa>
    <82e>   DW_AT_data_member_location: 56
 <2><82f>: Abbrev Number: 1 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x857db): XferCpltCallback
    <834>   DW_AT_decl_file   : 10
    <835>   DW_AT_decl_line   : 150
    <836>   DW_AT_decl_column : 33
    <837>   DW_AT_type        : <0x8bc>
    <83b>   DW_AT_data_member_location: 60
 <2><83c>: Abbrev Number: 1 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x684f1): XferHalfCpltCallback
    <841>   DW_AT_decl_file   : 10
    <842>   DW_AT_decl_line   : 152
    <843>   DW_AT_decl_column : 33
    <844>   DW_AT_type        : <0x8bc>
    <848>   DW_AT_data_member_location: 64
 <2><849>: Abbrev Number: 1 (DW_TAG_member)
    <84a>   DW_AT_name        : (indirect string, offset: 0x206ed): XferM1CpltCallback
    <84e>   DW_AT_decl_file   : 10
    <84f>   DW_AT_decl_line   : 154
    <850>   DW_AT_decl_column : 33
    <851>   DW_AT_type        : <0x8bc>
    <855>   DW_AT_data_member_location: 68
 <2><856>: Abbrev Number: 1 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0x4aa72): XferM1HalfCpltCallback
    <85b>   DW_AT_decl_file   : 10
    <85c>   DW_AT_decl_line   : 156
    <85d>   DW_AT_decl_column : 33
    <85e>   DW_AT_type        : <0x8bc>
    <862>   DW_AT_data_member_location: 72
 <2><863>: Abbrev Number: 1 (DW_TAG_member)
    <864>   DW_AT_name        : (indirect string, offset: 0x13a05): XferErrorCallback
    <868>   DW_AT_decl_file   : 10
    <869>   DW_AT_decl_line   : 158
    <86a>   DW_AT_decl_column : 33
    <86b>   DW_AT_type        : <0x8bc>
    <86f>   DW_AT_data_member_location: 76
 <2><870>: Abbrev Number: 1 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x7d0ea): XferAbortCallback
    <875>   DW_AT_decl_file   : 10
    <876>   DW_AT_decl_line   : 160
    <877>   DW_AT_decl_column : 33
    <878>   DW_AT_type        : <0x8bc>
    <87c>   DW_AT_data_member_location: 80
 <2><87d>: Abbrev Number: 1 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x83099): ErrorCode
    <882>   DW_AT_decl_file   : 10
    <883>   DW_AT_decl_line   : 162
    <884>   DW_AT_decl_column : 30
    <885>   DW_AT_type        : <0xc2>
    <889>   DW_AT_data_member_location: 84
 <2><88a>: Abbrev Number: 1 (DW_TAG_member)
    <88b>   DW_AT_name        : (indirect string, offset: 0x65455): StreamBaseAddress
    <88f>   DW_AT_decl_file   : 10
    <890>   DW_AT_decl_line   : 164
    <891>   DW_AT_decl_column : 30
    <892>   DW_AT_type        : <0xb6>
    <896>   DW_AT_data_member_location: 88
 <2><897>: Abbrev Number: 1 (DW_TAG_member)
    <898>   DW_AT_name        : (indirect string, offset: 0x704b6): StreamIndex
    <89c>   DW_AT_decl_file   : 10
    <89d>   DW_AT_decl_line   : 166
    <89e>   DW_AT_decl_column : 30
    <89f>   DW_AT_type        : <0xb6>
    <8a3>   DW_AT_data_member_location: 92
 <2><8a4>: Abbrev Number: 0
 <1><8a5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8a6>   DW_AT_byte_size   : 4
    <8a6>   DW_AT_type        : <0x13d>
 <1><8aa>: Abbrev Number: 33 (DW_TAG_pointer_type)
    <8ab>   DW_AT_byte_size   : 4
 <1><8ac>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <8ad>   DW_AT_prototyped  : 1
    <8ad>   DW_AT_sibling     : <0x8b7>
 <2><8b1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <8b2>   DW_AT_type        : <0x8b7>
 <2><8b6>: Abbrev Number: 0
 <1><8b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8b8>   DW_AT_byte_size   : 4
    <8b8>   DW_AT_type        : <0x7e2>
 <1><8bc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8bd>   DW_AT_byte_size   : 4
    <8bd>   DW_AT_type        : <0x8ac>
 <1><8c1>: Abbrev Number: 4 (DW_TAG_typedef)
    <8c2>   DW_AT_name        : (indirect string, offset: 0x71b06): DMA_HandleTypeDef
    <8c6>   DW_AT_decl_file   : 10
    <8c7>   DW_AT_decl_line   : 168
    <8c8>   DW_AT_decl_column : 2
    <8c9>   DW_AT_type        : <0x7e2>
 <1><8cd>: Abbrev Number: 9 (DW_TAG_structure_type)
    <8ce>   DW_AT_byte_size   : 44
    <8cf>   DW_AT_decl_file   : 11
    <8d0>   DW_AT_decl_line   : 46
    <8d1>   DW_AT_decl_column : 9
    <8d1>   DW_AT_sibling     : <0x965>
 <2><8d5>: Abbrev Number: 1 (DW_TAG_member)
    <8d6>   DW_AT_name        : (indirect string, offset: 0x4de25): Mode
    <8da>   DW_AT_decl_file   : 11
    <8db>   DW_AT_decl_line   : 48
    <8dc>   DW_AT_decl_column : 12
    <8dd>   DW_AT_type        : <0xb6>
    <8e1>   DW_AT_data_member_location: 0
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x316fa): Direction
    <8e7>   DW_AT_decl_file   : 11
    <8e8>   DW_AT_decl_line   : 51
    <8e9>   DW_AT_decl_column : 12
    <8ea>   DW_AT_type        : <0xb6>
    <8ee>   DW_AT_data_member_location: 4
 <2><8ef>: Abbrev Number: 1 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x66cf5): DataSize
    <8f4>   DW_AT_decl_file   : 11
    <8f5>   DW_AT_decl_line   : 54
    <8f6>   DW_AT_decl_column : 12
    <8f7>   DW_AT_type        : <0xb6>
    <8fb>   DW_AT_data_member_location: 8
 <2><8fc>: Abbrev Number: 1 (DW_TAG_member)
    <8fd>   DW_AT_name        : (indirect string, offset: 0x5380): CLKPolarity
    <901>   DW_AT_decl_file   : 11
    <902>   DW_AT_decl_line   : 57
    <903>   DW_AT_decl_column : 12
    <904>   DW_AT_type        : <0xb6>
    <908>   DW_AT_data_member_location: 12
 <2><909>: Abbrev Number: 1 (DW_TAG_member)
    <90a>   DW_AT_name        : (indirect string, offset: 0x5a145): CLKPhase
    <90e>   DW_AT_decl_file   : 11
    <90f>   DW_AT_decl_line   : 60
    <910>   DW_AT_decl_column : 12
    <911>   DW_AT_type        : <0xb6>
    <915>   DW_AT_data_member_location: 16
 <2><916>: Abbrev Number: 13 (DW_TAG_member)
    <917>   DW_AT_name        : NSS
    <91b>   DW_AT_decl_file   : 11
    <91c>   DW_AT_decl_line   : 63
    <91d>   DW_AT_decl_column : 12
    <91e>   DW_AT_type        : <0xb6>
    <922>   DW_AT_data_member_location: 20
 <2><923>: Abbrev Number: 1 (DW_TAG_member)
    <924>   DW_AT_name        : (indirect string, offset: 0x3942d): BaudRatePrescaler
    <928>   DW_AT_decl_file   : 11
    <929>   DW_AT_decl_line   : 67
    <92a>   DW_AT_decl_column : 12
    <92b>   DW_AT_type        : <0xb6>
    <92f>   DW_AT_data_member_location: 24
 <2><930>: Abbrev Number: 1 (DW_TAG_member)
    <931>   DW_AT_name        : (indirect string, offset: 0x56c14): FirstBit
    <935>   DW_AT_decl_file   : 11
    <936>   DW_AT_decl_line   : 73
    <937>   DW_AT_decl_column : 12
    <938>   DW_AT_type        : <0xb6>
    <93c>   DW_AT_data_member_location: 28
 <2><93d>: Abbrev Number: 1 (DW_TAG_member)
    <93e>   DW_AT_name        : (indirect string, offset: 0x4de23): TIMode
    <942>   DW_AT_decl_file   : 11
    <943>   DW_AT_decl_line   : 76
    <944>   DW_AT_decl_column : 12
    <945>   DW_AT_type        : <0xb6>
    <949>   DW_AT_data_member_location: 32
 <2><94a>: Abbrev Number: 1 (DW_TAG_member)
    <94b>   DW_AT_name        : (indirect string, offset: 0x5f571): CRCCalculation
    <94f>   DW_AT_decl_file   : 11
    <950>   DW_AT_decl_line   : 79
    <951>   DW_AT_decl_column : 12
    <952>   DW_AT_type        : <0xb6>
    <956>   DW_AT_data_member_location: 36
 <2><957>: Abbrev Number: 1 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x48f29): CRCPolynomial
    <95c>   DW_AT_decl_file   : 11
    <95d>   DW_AT_decl_line   : 82
    <95e>   DW_AT_decl_column : 12
    <95f>   DW_AT_type        : <0xb6>
    <963>   DW_AT_data_member_location: 40
 <2><964>: Abbrev Number: 0
 <1><965>: Abbrev Number: 4 (DW_TAG_typedef)
    <966>   DW_AT_name        : (indirect string, offset: 0x19b54): SPI_InitTypeDef
    <96a>   DW_AT_decl_file   : 11
    <96b>   DW_AT_decl_line   : 84
    <96c>   DW_AT_decl_column : 3
    <96d>   DW_AT_type        : <0x8cd>
 <1><971>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <972>   DW_AT_encoding    : 7	(unsigned)
    <973>   DW_AT_byte_size   : 1
    <974>   DW_AT_type        : <0x3d>
    <978>   DW_AT_decl_file   : 11
    <979>   DW_AT_decl_line   : 90
    <97a>   DW_AT_decl_column : 1
    <97b>   DW_AT_sibling     : <0x9b0>
 <2><97f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <980>   DW_AT_name        : (indirect string, offset: 0x5848e): HAL_SPI_STATE_RESET
    <984>   DW_AT_const_value : 0
 <2><985>: Abbrev Number: 3 (DW_TAG_enumerator)
    <986>   DW_AT_name        : (indirect string, offset: 0x1a6f7): HAL_SPI_STATE_READY
    <98a>   DW_AT_const_value : 1
 <2><98b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <98c>   DW_AT_name        : (indirect string, offset: 0x70c92): HAL_SPI_STATE_BUSY
    <990>   DW_AT_const_value : 2
 <2><991>: Abbrev Number: 3 (DW_TAG_enumerator)
    <992>   DW_AT_name        : (indirect string, offset: 0x49a39): HAL_SPI_STATE_BUSY_TX
    <996>   DW_AT_const_value : 3
 <2><997>: Abbrev Number: 3 (DW_TAG_enumerator)
    <998>   DW_AT_name        : (indirect string, offset: 0x48cdd): HAL_SPI_STATE_BUSY_RX
    <99c>   DW_AT_const_value : 4
 <2><99d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99e>   DW_AT_name        : (indirect string, offset: 0x372cf): HAL_SPI_STATE_BUSY_TX_RX
    <9a2>   DW_AT_const_value : 5
 <2><9a3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x67d22): HAL_SPI_STATE_ERROR
    <9a8>   DW_AT_const_value : 6
 <2><9a9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x13cad): HAL_SPI_STATE_ABORT
    <9ae>   DW_AT_const_value : 7
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x79102): HAL_SPI_StateTypeDef
    <9b5>   DW_AT_decl_file   : 11
    <9b6>   DW_AT_decl_line   : 99
    <9b7>   DW_AT_decl_column : 3
    <9b8>   DW_AT_type        : <0x971>
 <1><9bc>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <9bd>   DW_AT_type        : <0x9b0>
 <1><9c1>: Abbrev Number: 24 (DW_TAG_structure_type)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x7753c): __SPI_HandleTypeDef
    <9c6>   DW_AT_byte_size   : 88
    <9c7>   DW_AT_decl_file   : 11
    <9c8>   DW_AT_decl_line   : 104
    <9c9>   DW_AT_decl_column : 16
    <9c9>   DW_AT_sibling     : <0xa91>
 <2><9cd>: Abbrev Number: 1 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x33dda): Instance
    <9d2>   DW_AT_decl_file   : 11
    <9d3>   DW_AT_decl_line   : 106
    <9d4>   DW_AT_decl_column : 31
    <9d5>   DW_AT_type        : <0xa91>
    <9d9>   DW_AT_data_member_location: 0
 <2><9da>: Abbrev Number: 1 (DW_TAG_member)
    <9db>   DW_AT_name        : (indirect string, offset: 0x8384d): Init
    <9df>   DW_AT_decl_file   : 11
    <9e0>   DW_AT_decl_line   : 108
    <9e1>   DW_AT_decl_column : 30
    <9e2>   DW_AT_type        : <0x965>
    <9e6>   DW_AT_data_member_location: 4
 <2><9e7>: Abbrev Number: 1 (DW_TAG_member)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x404ba): pTxBuffPtr
    <9ec>   DW_AT_decl_file   : 11
    <9ed>   DW_AT_decl_line   : 110
    <9ee>   DW_AT_decl_column : 31
    <9ef>   DW_AT_type        : <0xa96>
    <9f3>   DW_AT_data_member_location: 48
 <2><9f4>: Abbrev Number: 1 (DW_TAG_member)
    <9f5>   DW_AT_name        : (indirect string, offset: 0x39df): TxXferSize
    <9f9>   DW_AT_decl_file   : 11
    <9fa>   DW_AT_decl_line   : 112
    <9fb>   DW_AT_decl_column : 30
    <9fc>   DW_AT_type        : <0xa5>
    <a00>   DW_AT_data_member_location: 52
 <2><a01>: Abbrev Number: 1 (DW_TAG_member)
    <a02>   DW_AT_name        : (indirect string, offset: 0x8b471): TxXferCount
    <a06>   DW_AT_decl_file   : 11
    <a07>   DW_AT_decl_line   : 114
    <a08>   DW_AT_decl_column : 30
    <a09>   DW_AT_type        : <0xb1>
    <a0d>   DW_AT_data_member_location: 54
 <2><a0e>: Abbrev Number: 1 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x7c6c2): pRxBuffPtr
    <a13>   DW_AT_decl_file   : 11
    <a14>   DW_AT_decl_line   : 116
    <a15>   DW_AT_decl_column : 31
    <a16>   DW_AT_type        : <0xa9b>
    <a1a>   DW_AT_data_member_location: 56
 <2><a1b>: Abbrev Number: 1 (DW_TAG_member)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x42fb3): RxXferSize
    <a20>   DW_AT_decl_file   : 11
    <a21>   DW_AT_decl_line   : 118
    <a22>   DW_AT_decl_column : 30
    <a23>   DW_AT_type        : <0xa5>
    <a27>   DW_AT_data_member_location: 60
 <2><a28>: Abbrev Number: 1 (DW_TAG_member)
    <a29>   DW_AT_name        : (indirect string, offset: 0x50a22): RxXferCount
    <a2d>   DW_AT_decl_file   : 11
    <a2e>   DW_AT_decl_line   : 120
    <a2f>   DW_AT_decl_column : 30
    <a30>   DW_AT_type        : <0xb1>
    <a34>   DW_AT_data_member_location: 62
 <2><a35>: Abbrev Number: 1 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0x2595c): RxISR
    <a3a>   DW_AT_decl_file   : 11
    <a3b>   DW_AT_decl_line   : 122
    <a3c>   DW_AT_decl_column : 10
    <a3d>   DW_AT_type        : <0xab0>
    <a41>   DW_AT_data_member_location: 64
 <2><a42>: Abbrev Number: 1 (DW_TAG_member)
    <a43>   DW_AT_name        : (indirect string, offset: 0x437d5): TxISR
    <a47>   DW_AT_decl_file   : 11
    <a48>   DW_AT_decl_line   : 124
    <a49>   DW_AT_decl_column : 10
    <a4a>   DW_AT_type        : <0xab0>
    <a4e>   DW_AT_data_member_location: 68
 <2><a4f>: Abbrev Number: 1 (DW_TAG_member)
    <a50>   DW_AT_name        : (indirect string, offset: 0x828a5): hdmatx
    <a54>   DW_AT_decl_file   : 11
    <a55>   DW_AT_decl_line   : 126
    <a56>   DW_AT_decl_column : 31
    <a57>   DW_AT_type        : <0xab5>
    <a5b>   DW_AT_data_member_location: 72
 <2><a5c>: Abbrev Number: 1 (DW_TAG_member)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x81ef8): hdmarx
    <a61>   DW_AT_decl_file   : 11
    <a62>   DW_AT_decl_line   : 128
    <a63>   DW_AT_decl_column : 31
    <a64>   DW_AT_type        : <0xab5>
    <a68>   DW_AT_data_member_location: 76
 <2><a69>: Abbrev Number: 1 (DW_TAG_member)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x5f0a8): Lock
    <a6e>   DW_AT_decl_file   : 11
    <a6f>   DW_AT_decl_line   : 130
    <a70>   DW_AT_decl_column : 30
    <a71>   DW_AT_type        : <0x531>
    <a75>   DW_AT_data_member_location: 80
 <2><a76>: Abbrev Number: 1 (DW_TAG_member)
    <a77>   DW_AT_name        : (indirect string, offset: 0x5ac5a): State
    <a7b>   DW_AT_decl_file   : 11
    <a7c>   DW_AT_decl_line   : 132
    <a7d>   DW_AT_decl_column : 30
    <a7e>   DW_AT_type        : <0x9bc>
    <a82>   DW_AT_data_member_location: 81
 <2><a83>: Abbrev Number: 1 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0x83099): ErrorCode
    <a88>   DW_AT_decl_file   : 11
    <a89>   DW_AT_decl_line   : 134
    <a8a>   DW_AT_decl_column : 30
    <a8b>   DW_AT_type        : <0xc2>
    <a8f>   DW_AT_data_member_location: 84
 <2><a90>: Abbrev Number: 0
 <1><a91>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a92>   DW_AT_byte_size   : 4
    <a92>   DW_AT_type        : <0x466>
 <1><a96>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a97>   DW_AT_byte_size   : 4
    <a97>   DW_AT_type        : <0xa0>
 <1><a9b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a9c>   DW_AT_byte_size   : 4
    <a9c>   DW_AT_type        : <0x94>
 <1><aa0>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <aa1>   DW_AT_prototyped  : 1
    <aa1>   DW_AT_sibling     : <0xaab>
 <2><aa5>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <aa6>   DW_AT_type        : <0xaab>
 <2><aaa>: Abbrev Number: 0
 <1><aab>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <aac>   DW_AT_byte_size   : 4
    <aac>   DW_AT_type        : <0x9c1>
 <1><ab0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ab1>   DW_AT_byte_size   : 4
    <ab1>   DW_AT_type        : <0xaa0>
 <1><ab5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ab6>   DW_AT_byte_size   : 4
    <ab6>   DW_AT_type        : <0x8c1>
 <1><aba>: Abbrev Number: 4 (DW_TAG_typedef)
    <abb>   DW_AT_name        : (indirect string, offset: 0x7753e): SPI_HandleTypeDef
    <abf>   DW_AT_decl_file   : 11
    <ac0>   DW_AT_decl_line   : 149
    <ac1>   DW_AT_decl_column : 3
    <ac2>   DW_AT_type        : <0x9c1>
 <1><ac6>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ac7>   DW_AT_byte_size   : 28
    <ac8>   DW_AT_decl_file   : 12
    <ac9>   DW_AT_decl_line   : 46
    <aca>   DW_AT_decl_column : 9
    <aca>   DW_AT_sibling     : <0xb2a>
 <2><ace>: Abbrev Number: 1 (DW_TAG_member)
    <acf>   DW_AT_name        : (indirect string, offset: 0x7a939): BaudRate
    <ad3>   DW_AT_decl_file   : 12
    <ad4>   DW_AT_decl_line   : 48
    <ad5>   DW_AT_decl_column : 12
    <ad6>   DW_AT_type        : <0xb6>
    <ada>   DW_AT_data_member_location: 0
 <2><adb>: Abbrev Number: 1 (DW_TAG_member)
    <adc>   DW_AT_name        : (indirect string, offset: 0x37df): WordLength
    <ae0>   DW_AT_decl_file   : 12
    <ae1>   DW_AT_decl_line   : 54
    <ae2>   DW_AT_decl_column : 12
    <ae3>   DW_AT_type        : <0xb6>
    <ae7>   DW_AT_data_member_location: 4
 <2><ae8>: Abbrev Number: 1 (DW_TAG_member)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x7ac12): StopBits
    <aed>   DW_AT_decl_file   : 12
    <aee>   DW_AT_decl_line   : 57
    <aef>   DW_AT_decl_column : 12
    <af0>   DW_AT_type        : <0xb6>
    <af4>   DW_AT_data_member_location: 8
 <2><af5>: Abbrev Number: 1 (DW_TAG_member)
    <af6>   DW_AT_name        : (indirect string, offset: 0x2fb42): Parity
    <afa>   DW_AT_decl_file   : 12
    <afb>   DW_AT_decl_line   : 60
    <afc>   DW_AT_decl_column : 12
    <afd>   DW_AT_type        : <0xb6>
    <b01>   DW_AT_data_member_location: 12
 <2><b02>: Abbrev Number: 1 (DW_TAG_member)
    <b03>   DW_AT_name        : (indirect string, offset: 0x4de25): Mode
    <b07>   DW_AT_decl_file   : 12
    <b08>   DW_AT_decl_line   : 67
    <b09>   DW_AT_decl_column : 12
    <b0a>   DW_AT_type        : <0xb6>
    <b0e>   DW_AT_data_member_location: 16
 <2><b0f>: Abbrev Number: 1 (DW_TAG_member)
    <b10>   DW_AT_name        : (indirect string, offset: 0xf4f4): HwFlowCtl
    <b14>   DW_AT_decl_file   : 12
    <b15>   DW_AT_decl_line   : 70
    <b16>   DW_AT_decl_column : 12
    <b17>   DW_AT_type        : <0xb6>
    <b1b>   DW_AT_data_member_location: 20
 <2><b1c>: Abbrev Number: 1 (DW_TAG_member)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x701d7): OverSampling
    <b21>   DW_AT_decl_file   : 12
    <b22>   DW_AT_decl_line   : 73
    <b23>   DW_AT_decl_column : 12
    <b24>   DW_AT_type        : <0xb6>
    <b28>   DW_AT_data_member_location: 24
 <2><b29>: Abbrev Number: 0
 <1><b2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x25fa5): UART_InitTypeDef
    <b2f>   DW_AT_decl_file   : 12
    <b30>   DW_AT_decl_line   : 75
    <b31>   DW_AT_decl_column : 3
    <b32>   DW_AT_type        : <0xac6>
 <1><b36>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <b37>   DW_AT_encoding    : 7	(unsigned)
    <b38>   DW_AT_byte_size   : 1
    <b39>   DW_AT_type        : <0x3d>
    <b3d>   DW_AT_decl_file   : 12
    <b3e>   DW_AT_decl_line   : 117
    <b3f>   DW_AT_decl_column : 1
    <b40>   DW_AT_sibling     : <0xb75>
 <2><b44>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b45>   DW_AT_name        : (indirect string, offset: 0x4ed47): HAL_UART_STATE_RESET
    <b49>   DW_AT_const_value : 0
 <2><b4a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b4b>   DW_AT_name        : (indirect string, offset: 0xf1d8): HAL_UART_STATE_READY
    <b4f>   DW_AT_const_value : 32
 <2><b50>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b51>   DW_AT_name        : (indirect string, offset: 0x76d7d): HAL_UART_STATE_BUSY
    <b55>   DW_AT_const_value : 36
 <2><b56>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b57>   DW_AT_name        : (indirect string, offset: 0x1773): HAL_UART_STATE_BUSY_TX
    <b5b>   DW_AT_const_value : 33
 <2><b5c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b5d>   DW_AT_name        : (indirect string, offset: 0xfec): HAL_UART_STATE_BUSY_RX
    <b61>   DW_AT_const_value : 34
 <2><b62>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b63>   DW_AT_name        : (indirect string, offset: 0x1e7c6): HAL_UART_STATE_BUSY_TX_RX
    <b67>   DW_AT_const_value : 35
 <2><b68>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b69>   DW_AT_name        : (indirect string, offset: 0x4154e): HAL_UART_STATE_TIMEOUT
    <b6d>   DW_AT_const_value : 160
 <2><b6e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x5d36a): HAL_UART_STATE_ERROR
    <b73>   DW_AT_const_value : 224
 <2><b74>: Abbrev Number: 0
 <1><b75>: Abbrev Number: 4 (DW_TAG_typedef)
    <b76>   DW_AT_name        : (indirect string, offset: 0x28f98): HAL_UART_StateTypeDef
    <b7a>   DW_AT_decl_file   : 12
    <b7b>   DW_AT_decl_line   : 135
    <b7c>   DW_AT_decl_column : 3
    <b7d>   DW_AT_type        : <0xb36>
 <1><b81>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b82>   DW_AT_type        : <0xb75>
 <1><b86>: Abbrev Number: 4 (DW_TAG_typedef)
    <b87>   DW_AT_name        : (indirect string, offset: 0x36af7): HAL_UART_RxTypeTypeDef
    <b8b>   DW_AT_decl_file   : 12
    <b8c>   DW_AT_decl_line   : 144
    <b8d>   DW_AT_decl_column : 18
    <b8e>   DW_AT_type        : <0xb6>
 <1><b92>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <b93>   DW_AT_type        : <0xb86>
 <1><b97>: Abbrev Number: 4 (DW_TAG_typedef)
    <b98>   DW_AT_name        : (indirect string, offset: 0x10686): HAL_UART_RxEventTypeTypeDef
    <b9c>   DW_AT_decl_file   : 12
    <b9d>   DW_AT_decl_line   : 155
    <b9e>   DW_AT_decl_column : 18
    <b9f>   DW_AT_type        : <0xb6>
 <1><ba3>: Abbrev Number: 10 (DW_TAG_volatile_type)
    <ba4>   DW_AT_type        : <0xb97>
 <1><ba8>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ba9>   DW_AT_name        : (indirect string, offset: 0x4e039): __UART_HandleTypeDef
    <bad>   DW_AT_byte_size   : 72
    <bae>   DW_AT_decl_file   : 12
    <baf>   DW_AT_decl_line   : 160
    <bb0>   DW_AT_decl_column : 16
    <bb0>   DW_AT_sibling     : <0xc85>
 <2><bb4>: Abbrev Number: 1 (DW_TAG_member)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x33dda): Instance
    <bb9>   DW_AT_decl_file   : 12
    <bba>   DW_AT_decl_line   : 162
    <bbb>   DW_AT_decl_column : 34
    <bbc>   DW_AT_type        : <0xc85>
    <bc0>   DW_AT_data_member_location: 0
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x8384d): Init
    <bc6>   DW_AT_decl_file   : 12
    <bc7>   DW_AT_decl_line   : 164
    <bc8>   DW_AT_decl_column : 33
    <bc9>   DW_AT_type        : <0xb2a>
    <bcd>   DW_AT_data_member_location: 4
 <2><bce>: Abbrev Number: 1 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x404ba): pTxBuffPtr
    <bd3>   DW_AT_decl_file   : 12
    <bd4>   DW_AT_decl_line   : 166
    <bd5>   DW_AT_decl_column : 34
    <bd6>   DW_AT_type        : <0xa96>
    <bda>   DW_AT_data_member_location: 32
 <2><bdb>: Abbrev Number: 1 (DW_TAG_member)
    <bdc>   DW_AT_name        : (indirect string, offset: 0x39df): TxXferSize
    <be0>   DW_AT_decl_file   : 12
    <be1>   DW_AT_decl_line   : 168
    <be2>   DW_AT_decl_column : 33
    <be3>   DW_AT_type        : <0xa5>
    <be7>   DW_AT_data_member_location: 36
 <2><be8>: Abbrev Number: 1 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0x8b471): TxXferCount
    <bed>   DW_AT_decl_file   : 12
    <bee>   DW_AT_decl_line   : 170
    <bef>   DW_AT_decl_column : 33
    <bf0>   DW_AT_type        : <0xb1>
    <bf4>   DW_AT_data_member_location: 38
 <2><bf5>: Abbrev Number: 1 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x7c6c2): pRxBuffPtr
    <bfa>   DW_AT_decl_file   : 12
    <bfb>   DW_AT_decl_line   : 172
    <bfc>   DW_AT_decl_column : 34
    <bfd>   DW_AT_type        : <0xa9b>
    <c01>   DW_AT_data_member_location: 40
 <2><c02>: Abbrev Number: 1 (DW_TAG_member)
    <c03>   DW_AT_name        : (indirect string, offset: 0x42fb3): RxXferSize
    <c07>   DW_AT_decl_file   : 12
    <c08>   DW_AT_decl_line   : 174
    <c09>   DW_AT_decl_column : 33
    <c0a>   DW_AT_type        : <0xa5>
    <c0e>   DW_AT_data_member_location: 44
 <2><c0f>: Abbrev Number: 1 (DW_TAG_member)
    <c10>   DW_AT_name        : (indirect string, offset: 0x50a22): RxXferCount
    <c14>   DW_AT_decl_file   : 12
    <c15>   DW_AT_decl_line   : 176
    <c16>   DW_AT_decl_column : 33
    <c17>   DW_AT_type        : <0xb1>
    <c1b>   DW_AT_data_member_location: 46
 <2><c1c>: Abbrev Number: 1 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0x6fa5a): ReceptionType
    <c21>   DW_AT_decl_file   : 12
    <c22>   DW_AT_decl_line   : 178
    <c23>   DW_AT_decl_column : 31
    <c24>   DW_AT_type        : <0xb92>
    <c28>   DW_AT_data_member_location: 48
 <2><c29>: Abbrev Number: 1 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0x8bab7): RxEventType
    <c2e>   DW_AT_decl_file   : 12
    <c2f>   DW_AT_decl_line   : 180
    <c30>   DW_AT_decl_column : 36
    <c31>   DW_AT_type        : <0xba3>
    <c35>   DW_AT_data_member_location: 52
 <2><c36>: Abbrev Number: 1 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0x828a5): hdmatx
    <c3b>   DW_AT_decl_file   : 12
    <c3c>   DW_AT_decl_line   : 182
    <c3d>   DW_AT_decl_column : 34
    <c3e>   DW_AT_type        : <0xab5>
    <c42>   DW_AT_data_member_location: 56
 <2><c43>: Abbrev Number: 1 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0x81ef8): hdmarx
    <c48>   DW_AT_decl_file   : 12
    <c49>   DW_AT_decl_line   : 184
    <c4a>   DW_AT_decl_column : 34
    <c4b>   DW_AT_type        : <0xab5>
    <c4f>   DW_AT_data_member_location: 60
 <2><c50>: Abbrev Number: 1 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0x5f0a8): Lock
    <c55>   DW_AT_decl_file   : 12
    <c56>   DW_AT_decl_line   : 186
    <c57>   DW_AT_decl_column : 33
    <c58>   DW_AT_type        : <0x531>
    <c5c>   DW_AT_data_member_location: 64
 <2><c5d>: Abbrev Number: 1 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x36410): gState
    <c62>   DW_AT_decl_file   : 12
    <c63>   DW_AT_decl_line   : 188
    <c64>   DW_AT_decl_column : 33
    <c65>   DW_AT_type        : <0xb81>
    <c69>   DW_AT_data_member_location: 65
 <2><c6a>: Abbrev Number: 1 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x78cdb): RxState
    <c6f>   DW_AT_decl_file   : 12
    <c70>   DW_AT_decl_line   : 192
    <c71>   DW_AT_decl_column : 33
    <c72>   DW_AT_type        : <0xb81>
    <c76>   DW_AT_data_member_location: 66
 <2><c77>: Abbrev Number: 1 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0x83099): ErrorCode
    <c7c>   DW_AT_decl_file   : 12
    <c7d>   DW_AT_decl_line   : 195
    <c7e>   DW_AT_decl_column : 33
    <c7f>   DW_AT_type        : <0xc2>
    <c83>   DW_AT_data_member_location: 68
 <2><c84>: Abbrev Number: 0
 <1><c85>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c86>   DW_AT_byte_size   : 4
    <c86>   DW_AT_type        : <0x4d0>
 <1><c8a>: Abbrev Number: 4 (DW_TAG_typedef)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x4e03b): UART_HandleTypeDef
    <c8f>   DW_AT_decl_file   : 12
    <c90>   DW_AT_decl_line   : 213
    <c91>   DW_AT_decl_column : 3
    <c92>   DW_AT_type        : <0xba8>
 <1><c96>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c97>   DW_AT_byte_size   : 4
    <c97>   DW_AT_type        : <0xca2>
 <1><c9b>: Abbrev Number: 8 (DW_TAG_base_type)
    <c9c>   DW_AT_byte_size   : 1
    <c9d>   DW_AT_encoding    : 8	(unsigned char)
    <c9e>   DW_AT_name        : (indirect string, offset: 0x2b655): char
 <1><ca2>: Abbrev Number: 12 (DW_TAG_const_type)
    <ca3>   DW_AT_type        : <0xc9b>
 <1><ca7>: Abbrev Number: 11 (DW_TAG_enumeration_type)
    <ca8>   DW_AT_encoding    : 5	(signed)
    <ca9>   DW_AT_byte_size   : 4
    <caa>   DW_AT_type        : <0x86>
    <cae>   DW_AT_decl_file   : 13
    <caf>   DW_AT_decl_line   : 176
    <cb0>   DW_AT_decl_column : 14
    <cb1>   DW_AT_sibling     : <0xce9>
 <2><cb5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <cb6>   DW_AT_name        : (indirect string, offset: 0x768bd): osOK
    <cba>   DW_AT_const_value : 0
 <2><cbb>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x3de06): osError
    <cc0>   DW_AT_const_value : -1
 <2><cc1>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x138d8): osErrorTimeout
    <cc6>   DW_AT_const_value : -2
 <2><cc7>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cc8>   DW_AT_name        : (indirect string, offset: 0x574a7): osErrorResource
    <ccc>   DW_AT_const_value : -3
 <2><ccd>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cce>   DW_AT_name        : (indirect string, offset: 0x2312f): osErrorParameter
    <cd2>   DW_AT_const_value : -4
 <2><cd3>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x17d28): osErrorNoMemory
    <cd8>   DW_AT_const_value : -5
 <2><cd9>: Abbrev Number: 16 (DW_TAG_enumerator)
    <cda>   DW_AT_name        : (indirect string, offset: 0x247d9): osErrorISR
    <cde>   DW_AT_const_value : -6
 <2><cdf>: Abbrev Number: 34 (DW_TAG_enumerator)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x43fdc): osStatusReserved
    <ce4>   DW_AT_const_value : 0x7fffffff
 <2><ce8>: Abbrev Number: 0
 <1><ce9>: Abbrev Number: 4 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x2d59d): osStatus_t
    <cee>   DW_AT_decl_file   : 13
    <cef>   DW_AT_decl_line   : 185
    <cf0>   DW_AT_decl_column : 3
    <cf1>   DW_AT_type        : <0xca7>
 <1><cf5>: Abbrev Number: 4 (DW_TAG_typedef)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x6d602): osTimerId_t
    <cfa>   DW_AT_decl_file   : 13
    <cfb>   DW_AT_decl_line   : 192
    <cfc>   DW_AT_decl_column : 15
    <cfd>   DW_AT_type        : <0x8aa>
 <1><d01>: Abbrev Number: 4 (DW_TAG_typedef)
    <d02>   DW_AT_name        : (indirect string, offset: 0x3c241): osMessageQueueId_t
    <d06>   DW_AT_decl_file   : 13
    <d07>   DW_AT_decl_line   : 207
    <d08>   DW_AT_decl_column : 15
    <d09>   DW_AT_type        : <0x8aa>
 <1><d0d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0e>   DW_AT_byte_size   : 16
    <d0f>   DW_AT_decl_file   : 13
    <d10>   DW_AT_decl_line   : 231
    <d11>   DW_AT_decl_column : 9
    <d11>   DW_AT_sibling     : <0xd4a>
 <2><d15>: Abbrev Number: 1 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0x58fa9): name
    <d1a>   DW_AT_decl_file   : 13
    <d1b>   DW_AT_decl_line   : 232
    <d1c>   DW_AT_decl_column : 33
    <d1d>   DW_AT_type        : <0xc96>
    <d21>   DW_AT_data_member_location: 0
 <2><d22>: Abbrev Number: 1 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0x5735f): attr_bits
    <d27>   DW_AT_decl_file   : 13
    <d28>   DW_AT_decl_line   : 233
    <d29>   DW_AT_decl_column : 28
    <d2a>   DW_AT_type        : <0xb6>
    <d2e>   DW_AT_data_member_location: 4
 <2><d2f>: Abbrev Number: 1 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x1aae7): cb_mem
    <d34>   DW_AT_decl_file   : 13
    <d35>   DW_AT_decl_line   : 234
    <d36>   DW_AT_decl_column : 30
    <d37>   DW_AT_type        : <0x8aa>
    <d3b>   DW_AT_data_member_location: 8
 <2><d3c>: Abbrev Number: 1 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x51c2a): cb_size
    <d41>   DW_AT_decl_file   : 13
    <d42>   DW_AT_decl_line   : 235
    <d43>   DW_AT_decl_column : 30
    <d44>   DW_AT_type        : <0xb6>
    <d48>   DW_AT_data_member_location: 12
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d4b>   DW_AT_name        : (indirect string, offset: 0x755a8): osTimerAttr_t
    <d4f>   DW_AT_decl_file   : 13
    <d50>   DW_AT_decl_line   : 236
    <d51>   DW_AT_decl_column : 3
    <d52>   DW_AT_type        : <0xd0d>
 <1><d56>: Abbrev Number: 12 (DW_TAG_const_type)
    <d57>   DW_AT_type        : <0xd4a>
 <1><d5b>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d5c>   DW_AT_byte_size   : 24
    <d5d>   DW_AT_decl_file   : 13
    <d5e>   DW_AT_decl_line   : 273
    <d60>   DW_AT_decl_column : 9
    <d60>   DW_AT_sibling     : <0xdb9>
 <2><d64>: Abbrev Number: 2 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0x58fa9): name
    <d69>   DW_AT_decl_file   : 13
    <d6a>   DW_AT_decl_line   : 274
    <d6c>   DW_AT_decl_column : 33
    <d6d>   DW_AT_type        : <0xc96>
    <d71>   DW_AT_data_member_location: 0
 <2><d72>: Abbrev Number: 2 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0x5735f): attr_bits
    <d77>   DW_AT_decl_file   : 13
    <d78>   DW_AT_decl_line   : 275
    <d7a>   DW_AT_decl_column : 28
    <d7b>   DW_AT_type        : <0xb6>
    <d7f>   DW_AT_data_member_location: 4
 <2><d80>: Abbrev Number: 2 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0x1aae7): cb_mem
    <d85>   DW_AT_decl_file   : 13
    <d86>   DW_AT_decl_line   : 276
    <d88>   DW_AT_decl_column : 30
    <d89>   DW_AT_type        : <0x8aa>
    <d8d>   DW_AT_data_member_location: 8
 <2><d8e>: Abbrev Number: 2 (DW_TAG_member)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x51c2a): cb_size
    <d93>   DW_AT_decl_file   : 13
    <d94>   DW_AT_decl_line   : 277
    <d96>   DW_AT_decl_column : 30
    <d97>   DW_AT_type        : <0xb6>
    <d9b>   DW_AT_data_member_location: 12
 <2><d9c>: Abbrev Number: 2 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x34734): mq_mem
    <da1>   DW_AT_decl_file   : 13
    <da2>   DW_AT_decl_line   : 278
    <da4>   DW_AT_decl_column : 30
    <da5>   DW_AT_type        : <0x8aa>
    <da9>   DW_AT_data_member_location: 16
 <2><daa>: Abbrev Number: 2 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0x77a1b): mq_size
    <daf>   DW_AT_decl_file   : 13
    <db0>   DW_AT_decl_line   : 279
    <db2>   DW_AT_decl_column : 30
    <db3>   DW_AT_type        : <0xb6>
    <db7>   DW_AT_data_member_location: 20
 <2><db8>: Abbrev Number: 0
 <1><db9>: Abbrev Number: 15 (DW_TAG_typedef)
    <dba>   DW_AT_name        : (indirect string, offset: 0x71fbb): osMessageQueueAttr_t
    <dbe>   DW_AT_decl_file   : 13
    <dbf>   DW_AT_decl_line   : 280
    <dc1>   DW_AT_decl_column : 3
    <dc1>   DW_AT_type        : <0xd5b>
 <1><dc5>: Abbrev Number: 12 (DW_TAG_const_type)
    <dc6>   DW_AT_type        : <0xdb9>
 <1><dca>: Abbrev Number: 17 (DW_TAG_variable)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x7dde7): hspi2
    <dcf>   DW_AT_decl_file   : 1
    <dcf>   DW_AT_decl_line   : 45
    <dd0>   DW_AT_decl_column : 19
    <dd1>   DW_AT_type        : <0xaba>
    <dd5>   DW_AT_external    : 1
    <dd5>   DW_AT_location    : 5 byte block: 3 7c 0 0 20 	(DW_OP_addr: 2000007c)
 <1><ddb>: Abbrev Number: 17 (DW_TAG_variable)
    <ddc>   DW_AT_name        : (indirect string, offset: 0x4851d): huart2
    <de0>   DW_AT_decl_file   : 1
    <de0>   DW_AT_decl_line   : 47
    <de1>   DW_AT_decl_column : 20
    <de2>   DW_AT_type        : <0xc8a>
    <de6>   DW_AT_external    : 1
    <de6>   DW_AT_location    : 5 byte block: 3 d4 0 0 20 	(DW_OP_addr: 200000d4)
 <1><dec>: Abbrev Number: 17 (DW_TAG_variable)
    <ded>   DW_AT_name        : (indirect string, offset: 0x67b16): myQueue01Handle
    <df1>   DW_AT_decl_file   : 1
    <df1>   DW_AT_decl_line   : 50
    <df2>   DW_AT_decl_column : 20
    <df3>   DW_AT_type        : <0xd01>
    <df7>   DW_AT_external    : 1
    <df7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><dfd>: Abbrev Number: 17 (DW_TAG_variable)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x5084c): myQueue01_attributes
    <e02>   DW_AT_decl_file   : 1
    <e02>   DW_AT_decl_line   : 51
    <e03>   DW_AT_decl_column : 28
    <e04>   DW_AT_type        : <0xdc5>
    <e08>   DW_AT_external    : 1
    <e08>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e0e>: Abbrev Number: 17 (DW_TAG_variable)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x61cd1): myTimer01Handle
    <e13>   DW_AT_decl_file   : 1
    <e13>   DW_AT_decl_line   : 55
    <e14>   DW_AT_decl_column : 13
    <e15>   DW_AT_type        : <0xcf5>
    <e19>   DW_AT_external    : 1
    <e19>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e1f>: Abbrev Number: 17 (DW_TAG_variable)
    <e20>   DW_AT_name        : (indirect string, offset: 0x13fe7): myTimer01_attributes
    <e24>   DW_AT_decl_file   : 1
    <e24>   DW_AT_decl_line   : 56
    <e25>   DW_AT_decl_column : 21
    <e26>   DW_AT_type        : <0xd56>
    <e2a>   DW_AT_external    : 1
    <e2a>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><e30>: Abbrev Number: 26 (DW_TAG_subprogram)
    <e31>   DW_AT_external    : 1
    <e31>   DW_AT_name        : (indirect string, offset: 0x5261b): HAL_GPIO_Init
    <e35>   DW_AT_decl_file   : 9
    <e35>   DW_AT_decl_line   : 224
    <e36>   DW_AT_decl_column : 7
    <e37>   DW_AT_prototyped  : 1
    <e37>   DW_AT_declaration : 1
    <e37>   DW_AT_sibling     : <0xe46>
 <2><e3b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e3c>   DW_AT_type        : <0xe46>
 <2><e40>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e41>   DW_AT_type        : <0xe4b>
 <2><e45>: Abbrev Number: 0
 <1><e46>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e47>   DW_AT_byte_size   : 4
    <e47>   DW_AT_type        : <0x1e0>
 <1><e4b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e4c>   DW_AT_byte_size   : 4
    <e4c>   DW_AT_type        : <0x6ba>
 <1><e50>: Abbrev Number: 26 (DW_TAG_subprogram)
    <e51>   DW_AT_external    : 1
    <e51>   DW_AT_name        : (indirect string, offset: 0x185b9): HAL_GPIO_WritePin
    <e55>   DW_AT_decl_file   : 9
    <e55>   DW_AT_decl_line   : 235
    <e56>   DW_AT_decl_column : 6
    <e57>   DW_AT_prototyped  : 1
    <e57>   DW_AT_declaration : 1
    <e57>   DW_AT_sibling     : <0xe6b>
 <2><e5b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e5c>   DW_AT_type        : <0xe46>
 <2><e60>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e61>   DW_AT_type        : <0xa5>
 <2><e65>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e66>   DW_AT_type        : <0x6e1>
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e6c>   DW_AT_external    : 1
    <e6c>   DW_AT_name        : (indirect string, offset: 0x5fc44): HAL_UART_Init
    <e70>   DW_AT_decl_file   : 12
    <e71>   DW_AT_decl_line   : 718
    <e73>   DW_AT_decl_column : 19
    <e73>   DW_AT_prototyped  : 1
    <e73>   DW_AT_type        : <0x50a>
    <e77>   DW_AT_declaration : 1
    <e77>   DW_AT_sibling     : <0xe81>
 <2><e7b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e7c>   DW_AT_type        : <0xe81>
 <2><e80>: Abbrev Number: 0
 <1><e81>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e82>   DW_AT_byte_size   : 4
    <e82>   DW_AT_type        : <0xc8a>
 <1><e86>: Abbrev Number: 19 (DW_TAG_subprogram)
    <e87>   DW_AT_external    : 1
    <e87>   DW_AT_name        : (indirect string, offset: 0x48065): HAL_SPI_Init
    <e8b>   DW_AT_decl_file   : 11
    <e8c>   DW_AT_decl_line   : 655
    <e8e>   DW_AT_decl_column : 19
    <e8e>   DW_AT_prototyped  : 1
    <e8e>   DW_AT_type        : <0x50a>
    <e92>   DW_AT_declaration : 1
    <e92>   DW_AT_sibling     : <0xe9c>
 <2><e96>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <e97>   DW_AT_type        : <0xe9c>
 <2><e9b>: Abbrev Number: 0
 <1><e9c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e9d>   DW_AT_byte_size   : 4
    <e9d>   DW_AT_type        : <0xaba>
 <1><ea1>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ea2>   DW_AT_external    : 1
    <ea2>   DW_AT_name        : (indirect string, offset: 0x54811): HAL_RCC_ClockConfig
    <ea6>   DW_AT_decl_file   : 8
    <ea7>   DW_AT_decl_line   : 1246
    <ea9>   DW_AT_decl_column : 19
    <ea9>   DW_AT_prototyped  : 1
    <ea9>   DW_AT_type        : <0x50a>
    <ead>   DW_AT_declaration : 1
    <ead>   DW_AT_sibling     : <0xebc>
 <2><eb1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <eb2>   DW_AT_type        : <0xebc>
 <2><eb6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <eb7>   DW_AT_type        : <0xb6>
 <2><ebb>: Abbrev Number: 0
 <1><ebc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ebd>   DW_AT_byte_size   : 4
    <ebd>   DW_AT_type        : <0x66b>
 <1><ec1>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ec2>   DW_AT_external    : 1
    <ec2>   DW_AT_name        : (indirect string, offset: 0x5c6a0): HAL_RCC_OscConfig
    <ec6>   DW_AT_decl_file   : 8
    <ec7>   DW_AT_decl_line   : 1245
    <ec9>   DW_AT_decl_column : 19
    <ec9>   DW_AT_prototyped  : 1
    <ec9>   DW_AT_type        : <0x50a>
    <ecd>   DW_AT_declaration : 1
    <ecd>   DW_AT_sibling     : <0xed7>
 <2><ed1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ed2>   DW_AT_type        : <0xed7>
 <2><ed6>: Abbrev Number: 0
 <1><ed7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ed8>   DW_AT_byte_size   : 4
    <ed8>   DW_AT_type        : <0x610>
 <1><edc>: Abbrev Number: 27 (DW_TAG_subprogram)
    <edd>   DW_AT_external    : 1
    <edd>   DW_AT_name        : (indirect string, offset: 0x1fe69): osKernelStart
    <ee1>   DW_AT_decl_file   : 13
    <ee1>   DW_AT_decl_line   : 302
    <ee3>   DW_AT_decl_column : 12
    <ee3>   DW_AT_prototyped  : 1
    <ee3>   DW_AT_type        : <0xce9>
    <ee7>   DW_AT_declaration : 1
 <1><ee7>: Abbrev Number: 28 (DW_TAG_subprogram)
    <ee8>   DW_AT_external    : 1
    <ee8>   DW_AT_name        : (indirect string, offset: 0x76d91): create_demo_tasks
    <eec>   DW_AT_decl_file   : 14
    <eed>   DW_AT_decl_line   : 2
    <eee>   DW_AT_decl_column : 5
    <eef>   DW_AT_prototyped  : 1
    <eef>   DW_AT_type        : <0x86>
    <ef3>   DW_AT_declaration : 1
 <1><ef3>: Abbrev Number: 27 (DW_TAG_subprogram)
    <ef4>   DW_AT_external    : 1
    <ef4>   DW_AT_name        : (indirect string, offset: 0x69660): osKernelInitialize
    <ef8>   DW_AT_decl_file   : 13
    <ef8>   DW_AT_decl_line   : 287
    <efa>   DW_AT_decl_column : 12
    <efa>   DW_AT_prototyped  : 1
    <efa>   DW_AT_type        : <0xce9>
    <efe>   DW_AT_declaration : 1
 <1><efe>: Abbrev Number: 28 (DW_TAG_subprogram)
    <eff>   DW_AT_external    : 1
    <eff>   DW_AT_name        : (indirect string, offset: 0x7d953): HAL_Init
    <f03>   DW_AT_decl_file   : 15
    <f04>   DW_AT_decl_line   : 219
    <f05>   DW_AT_decl_column : 19
    <f06>   DW_AT_prototyped  : 1
    <f06>   DW_AT_type        : <0x50a>
    <f0a>   DW_AT_declaration : 1
 <1><f0a>: Abbrev Number: 35 (DW_TAG_subprogram)
    <f0b>   DW_AT_external    : 1
    <f0b>   DW_AT_name        : (indirect string, offset: 0x3b10c): Error_Handler
    <f0f>   DW_AT_decl_file   : 1
    <f10>   DW_AT_decl_line   : 295
    <f12>   DW_AT_decl_column : 6
    <f13>   DW_AT_prototyped  : 1
    <f13>   DW_AT_low_pc      : 0x8000854
    <f17>   DW_AT_high_pc     : 0xc
    <f1b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f1d>   DW_AT_call_all_calls: 1
    <f1d>   DW_AT_sibling     : <0xf33>
 <2><f21>: Abbrev Number: 36 (DW_TAG_inlined_subroutine)
    <f22>   DW_AT_abstract_origin: <0x106a>
    <f26>   DW_AT_low_pc      : 0x8000858
    <f2a>   DW_AT_high_pc     : 0x4
    <f2e>   DW_AT_call_file   : 1
    <f2f>   DW_AT_call_line   : 299
    <f31>   DW_AT_call_column : 3
 <2><f32>: Abbrev Number: 0
 <1><f33>: Abbrev Number: 37 (DW_TAG_subprogram)
    <f34>   DW_AT_name        : (indirect string, offset: 0x3688b): MX_GPIO_Init
    <f38>   DW_AT_decl_file   : 1
    <f39>   DW_AT_decl_line   : 256
    <f3b>   DW_AT_decl_column : 13
    <f3c>   DW_AT_prototyped  : 1
    <f3c>   DW_AT_low_pc      : 0x8000778
    <f40>   DW_AT_high_pc     : 0xdc
    <f44>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f46>   DW_AT_call_all_tail_calls: 1
    <f46>   DW_AT_sibling     : <0xfca>
 <2><f4a>: Abbrev Number: 18 (DW_TAG_variable)
    <f4b>   DW_AT_name        : (indirect string, offset: 0xc8d8): GPIO_InitStruct
    <f4f>   DW_AT_decl_file   : 1
    <f4f>   DW_AT_decl_line   : 258
    <f51>   DW_AT_decl_column : 20
    <f52>   DW_AT_type        : <0x6ba>
    <f56>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><f59>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <f5a>   DW_AT_low_pc      : 0x800078e
    <f5e>   DW_AT_high_pc     : 0x1c
    <f62>   DW_AT_sibling     : <0xf76>
 <3><f66>: Abbrev Number: 18 (DW_TAG_variable)
    <f67>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <f6b>   DW_AT_decl_file   : 1
    <f6b>   DW_AT_decl_line   : 264
    <f6d>   DW_AT_decl_column : 3
    <f6e>   DW_AT_type        : <0xc2>
    <f72>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><f75>: Abbrev Number: 0
 <2><f76>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <f77>   DW_AT_low_pc      : 0x80007aa
    <f7b>   DW_AT_high_pc     : 0x1c
    <f7f>   DW_AT_sibling     : <0xf93>
 <3><f83>: Abbrev Number: 18 (DW_TAG_variable)
    <f84>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <f88>   DW_AT_decl_file   : 1
    <f88>   DW_AT_decl_line   : 265
    <f8a>   DW_AT_decl_column : 3
    <f8b>   DW_AT_type        : <0xc2>
    <f8f>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><f92>: Abbrev Number: 0
 <2><f93>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <f94>   DW_AT_low_pc      : 0x80007c6
    <f98>   DW_AT_high_pc     : 0x1c
    <f9c>   DW_AT_sibling     : <0xfb0>
 <3><fa0>: Abbrev Number: 18 (DW_TAG_variable)
    <fa1>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <fa5>   DW_AT_decl_file   : 1
    <fa5>   DW_AT_decl_line   : 266
    <fa7>   DW_AT_decl_column : 3
    <fa8>   DW_AT_type        : <0xc2>
    <fac>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><faf>: Abbrev Number: 0
 <2><fb0>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <fb1>   DW_AT_low_pc      : 0x80007e2
    <fb5>   DW_AT_high_pc     : 0x1c
 <3><fb9>: Abbrev Number: 18 (DW_TAG_variable)
    <fba>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <fbe>   DW_AT_decl_file   : 1
    <fbe>   DW_AT_decl_line   : 267
    <fc0>   DW_AT_decl_column : 3
    <fc1>   DW_AT_type        : <0xc2>
    <fc5>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><fc8>: Abbrev Number: 0
 <2><fc9>: Abbrev Number: 0
 <1><fca>: Abbrev Number: 30 (DW_TAG_subprogram)
    <fcb>   DW_AT_name        : (indirect string, offset: 0x6e84a): MX_USART2_UART_Init
    <fcf>   DW_AT_decl_file   : 1
    <fcf>   DW_AT_decl_line   : 223
    <fd0>   DW_AT_decl_column : 13
    <fd0>   DW_AT_prototyped  : 1
    <fd0>   DW_AT_low_pc      : 0x8000724
    <fd4>   DW_AT_high_pc     : 0x54
    <fd8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fda>   DW_AT_call_all_tail_calls: 1
 <1><fda>: Abbrev Number: 30 (DW_TAG_subprogram)
    <fdb>   DW_AT_name        : (indirect string, offset: 0x83845): MX_SPI2_Init
    <fdf>   DW_AT_decl_file   : 1
    <fdf>   DW_AT_decl_line   : 185
    <fe0>   DW_AT_decl_column : 13
    <fe0>   DW_AT_prototyped  : 1
    <fe0>   DW_AT_low_pc      : 0x80006b8
    <fe4>   DW_AT_high_pc     : 0x6c
    <fe8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fea>   DW_AT_call_all_tail_calls: 1
 <1><fea>: Abbrev Number: 38 (DW_TAG_subprogram)
    <feb>   DW_AT_external    : 1
    <feb>   DW_AT_name        : (indirect string, offset: 0x5cab9): SystemClock_Config
    <fef>   DW_AT_decl_file   : 1
    <ff0>   DW_AT_decl_line   : 138
    <ff1>   DW_AT_decl_column : 6
    <ff2>   DW_AT_prototyped  : 1
    <ff2>   DW_AT_low_pc      : 0x80005e4
    <ff6>   DW_AT_high_pc     : 0xd4
    <ffa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ffc>   DW_AT_call_all_tail_calls: 1
    <ffc>   DW_AT_sibling     : <0x1054>
 <2><1000>: Abbrev Number: 21 (DW_TAG_variable)
    <1001>   DW_AT_name        : (indirect string, offset: 0x1d931): RCC_OscInitStruct
    <1005>   DW_AT_decl_file   : 1
    <1005>   DW_AT_decl_line   : 140
    <1006>   DW_AT_decl_column : 22
    <1007>   DW_AT_type        : <0x604>
    <100b>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><100e>: Abbrev Number: 21 (DW_TAG_variable)
    <100f>   DW_AT_name        : (indirect string, offset: 0x32509): RCC_ClkInitStruct
    <1013>   DW_AT_decl_file   : 1
    <1013>   DW_AT_decl_line   : 141
    <1014>   DW_AT_decl_column : 22
    <1015>   DW_AT_type        : <0x65f>
    <1019>   DW_AT_location    : 3 byte block: 91 b4 7f 	(DW_OP_fbreg: -76)
 <2><101d>: Abbrev Number: 20 (DW_TAG_lexical_block)
    <101e>   DW_AT_low_pc      : 0x8000608
    <1022>   DW_AT_high_pc     : 0x1c
    <1026>   DW_AT_sibling     : <0x103a>
 <3><102a>: Abbrev Number: 21 (DW_TAG_variable)
    <102b>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <102f>   DW_AT_decl_file   : 1
    <102f>   DW_AT_decl_line   : 145
    <1030>   DW_AT_decl_column : 3
    <1031>   DW_AT_type        : <0xc2>
    <1035>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <3><1039>: Abbrev Number: 0
 <2><103a>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <103b>   DW_AT_low_pc      : 0x8000624
    <103f>   DW_AT_high_pc     : 0x1c
 <3><1043>: Abbrev Number: 21 (DW_TAG_variable)
    <1044>   DW_AT_name        : (indirect string, offset: 0xf14): tmpreg
    <1048>   DW_AT_decl_file   : 1
    <1048>   DW_AT_decl_line   : 146
    <1049>   DW_AT_decl_column : 3
    <104a>   DW_AT_type        : <0xc2>
    <104e>   DW_AT_location    : 3 byte block: 91 ac 7f 	(DW_OP_fbreg: -84)
 <3><1052>: Abbrev Number: 0
 <2><1053>: Abbrev Number: 0
 <1><1054>: Abbrev Number: 39 (DW_TAG_subprogram)
    <1055>   DW_AT_external    : 1
    <1055>   DW_AT_name        : (indirect string, offset: 0xcf5d): main
    <1059>   DW_AT_decl_file   : 1
    <105a>   DW_AT_decl_line   : 82
    <105b>   DW_AT_decl_column : 5
    <105c>   DW_AT_prototyped  : 1
    <105c>   DW_AT_type        : <0x86>
    <1060>   DW_AT_low_pc      : 0x80005bc
    <1064>   DW_AT_high_pc     : 0x28
    <1068>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <106a>   DW_AT_call_all_tail_calls: 1
 <1><106a>: Abbrev Number: 40 (DW_TAG_subprogram)
    <106b>   DW_AT_name        : (indirect string, offset: 0x8175e): __disable_irq
    <106f>   DW_AT_decl_file   : 2
    <1070>   DW_AT_decl_line   : 960
    <1072>   DW_AT_decl_column : 27
    <1073>   DW_AT_prototyped  : 1
    <1073>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><1074>: Abbrev Number: 0
  Compilation Unit @ offset 0x1075:
   Length:        0xe04 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27d
   Pointer Size:  4
 <0><1081>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <1082>   DW_AT_producer    : (indirect string, offset: 0x83c83): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <1086>   DW_AT_language    : 29	(C11)
    <1087>   DW_AT_name        : (indirect string, offset: 0x86a18): ../Core/Src/stm32f4xx_hal_msp.c
    <108b>   DW_AT_comp_dir    : (indirect string, offset: 0x6c2aa): C:/Users/nvnpr/Documents/FreeRTOS/stm32f4_freertos/Debug
    <108f>   DW_AT_ranges      : 0x3f
    <1093>   DW_AT_low_pc      : 0
    <1097>   DW_AT_stmt_list   : 0xa19
    <109b>   DW_AT_macros      : 0x587
